{
  "version": "https://jsonfeed.org/version/1",
  "title": "Eric Bailey",
  "home_page_url": "https://ericwbailey.design",
  "feed_url": "https://ericwbailey.design/feed/feed.json",
  "description": "Boston-based user experience designer",
  "author": {
    "name": "Eric Bailey",
    "url": "https://ericwbailey.design"
  },
  "items": [{
      "id": "https://ericwbailey.design/writing/the-radium-craze/",
      "url": "https://ericwbailey.design/writing/the-radium-craze/",
      "title": "The Radium Craze",
      "content_html": "<p>Radium was discovered in 1898 by Polish chemist <a href=\"https://en.m.wikipedia.org/wiki/Marie_Curie\">Marie Sklodowska Curie</a>. To produce radium, you need to extract it from pitchblende, an ore that contains uranium.</p>\n<p>Radium was discovered in working with the known properties of <a href=\"https://en.m.wikipedia.org/wiki/Uraninite\">pitchblende</a>. Curie noticed that pitchblende in its unrefined state was more radioactive than the uranium that was separated from it. This lead her to correctly anticipate it containing additional radioactive properties.</p>\n<p>Extracting radium is a complicated and involved process that requires a team of trained professionals. Extraction needs to be conducted at scale, due to only trace amounts being present in the ore it is extracted from.</p>\n<p>After its discovery, scientists hailed it as a miracle element. Its unique properties came to represent modernity, industrialization, and technological advancement. The general public was quick to follow, and amplify this enthusiasm.</p>\n<h2 id=\"radium-girls\">Radium girls</h2>\n<p>Radium’s most obvious property is its luminosity. It glows with a distinct, eerie green color. Readers of this post may be familiar with one of its more infamous uses: <a href=\"https://en.m.wikipedia.org/wiki/Radium_dials\">painting it on watches</a> to create glow-in-the-dark dials.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"Source: Radium Dials by Arma95 on Wikimedia Commons\">\n  <img\n    alt=\"A glowing green watch dial floating in blackness.\"\n    src=\"/img/posts/the-radium-craze/radium-dial.jpg\" />\n  <figcaption>\n    <span class=\"typography-small-caps\">Source:</span> <a href=\"https://commons.wikimedia.org/wiki/File:Radium_Dial.jpg\">Radium Dials by Arma95</a> on Wikimedia Commons.\n  </figcaption>\n</figure>\n<p>Readers may also be familiar with <a href=\"https://www.buzzfeed.com/authorkatemoore/the-light-that-does-not-lie\">Radium Girls</a>. This deceptively cool-sounding name describes a working-class job that was highly desirable at the time. Radium’s technological applications afforded radium dial painters a salary that enabled a semblance of financial freedom. Radium’s public perception also gave the job a sense of glamor.</p>\n<p>Radium girls were women who were coerced by their male superiors to meet the demands of society and technology. They were instructed to use their mouths to form a fine tip on the paintbrushes used to apply radium paint.</p>\n<p>Over time, radium built up in these women’s bodies. This led to horrible injuries and tragic and extremely painful deaths. Before death, ulcers, lesions, sarcomas, the dissolving of tissue and honeycombing of bone occurred. The horrific symptom of a jaw rotting off occurred enough that the term “radium jaw” was coined.</p>\n<p>The employers of radium girls initially tried to ignore, gaslight, and shift blame about the adverse effects of radium exposure, and their part in it. The United States Radium Corporation tried to blame <a href=\"https://www.buzzfeed.com/authorkatemoore/the-light-that-does-not-lie\">Mollie Maggia</a>’s death by radium poisoning on a misdiagnosis of syphilis. They then conspired to create a mass coverup to hide the ill-effects of working with the technology.</p>\n<h2 id=\"productization\">Productization</h2>\n<p>What is less known is <a href=\"https://thehistoryvault.co.uk/the-radium-craze-americas-lethal-love-affair-by-matthew-moss/\">how deeply integrated radium was into daily life</a>. Radium was used a plot device in fiction, a beauty standard, even a topic for religious sermons.</p>\n<p>Radium’s rarity made it a prestige good. Businesses were quick to take its initial applications and create a whole host of radium-themed products and branding—the more coveted ones actually containing the element. It was laterally integrated into nearly every existing product space: cigarettes, toothpaste, hair cream, butter, blankets, fertilizer, cosmetics, etc.</p>\n<p>Radium’s integration also created a feedback loop that bolstered its credibility. This translated to its adoption by the medical community.</p>\n<p>Doctors praised the supposed medicinal effects of radium without knowing its full effects, touting the rejuvenating powers of irradiated metal. Irradiated tablets were sold to the general public, to say nothing of radium-themed suppositories.</p>\n<p>Perhaps the most infamous radium product was Radithor, a beverage created by Bailey Radium Laboratories. Radithor was marketed as an “elixir of life.” Unlike a lot of competing products in the radium beverage space, Radithor was a premium product that promised certified radioactive water.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"Source: Radium Dials by Arma95 on Wikimedia Commons\">\n  <img\n    alt=\"A bottle of Radithor sitting in front of a paper advertisement for it. The Radithor bottle's label indicates that it is certified radioactive water.\"\n    src=\"/img/posts/the-radium-craze/radithor.jpg\" />\n  <figcaption>\n    <span class=\"typography-small-caps\">Source:</span> <a href=\"https://afistfulofneurons.com/radium-water-radithor/\">“The Radium Water Worked Fine Until His Jaw Came Off”</a>.\n  </figcaption>\n</figure>\n<p>Pittsburgh socialite Eben M. Byers died by compulsively over-consuming Radithor—his body was so radioactive that he needed to be buried in a lead coffin. Because of Byers’ social position, as well as <a href=\"https://www.scribd.com/document/188172930/The-Radium-Water-Worked-Fine-Until-His-Jaw-Fell-Off\">coverage from the The Wall Street Journal</a>, regulatory bodies were compelled to take action in banning its use.</p>\n<h2 id=\"what-we-can-learn\">What we can learn</h2>\n<p>There can be a lot of external forces that compel our technology choices, who we have implement them, and how they go about it. Unlike the prewar era, we now know a lot more about how technologies are built, how they work, and what their short and potential long-term effects are.</p>\n<p>We should recognize the <a href=\"https://en.m.wikipedia.org/wiki/Law_of_the_instrument\">law of the instrument</a>.</p>\n<p>Blanket-applying radium to everything created horrific outcomes, some that we’re still being affected by today. Bottles of radium-infused beverages still show up in antique stores with some frequency. If they’re recognized as such, specialized containment and cleanup crews are brought in.</p>\n<p>This being said, radium has some positive applications. Contemporary uses include treating some forms of cancer, checking machined metal parts for defects, and sourcing neutrons. These are situations where radium’s properties are purposefully and deliberately applied.</p>\n<p>There’s a bit of nuance behind radium’s practical applications, as well: Many of its uses have been replaced by safer, more efficient innovations building off what it pioneered. The industries that use these technologies understand the importance of radium’s initial establishing role, but also utilize <a href=\"https://svelte.dev/\">its successors</a>.</p>\n<p>Technology drives outcomes, but <a href=\"https://macwright.com/2020/08/22/clean-starts-for-the-web.html\">its selection doesn’t live in a vacuum</a>. As technology workers, we have a responsibility to make <a href=\"https://www.gatsbyjs.com/blog/2019-07-11-user-testing-accessible-client-routing/\">careful and deliberate technology choices</a> and not cause undue immediate or long-term harm.</p>\n<p>A five page marketing website may not need <a href=\"https://css-tricks.com/radeventlistener-a-tale-of-client-side-framework-performance/\">a Single Page Application approach</a>. Consider what you’re trying to do, how you’re going to do it, and how you treat the people that help you get there.</p>\n",
      "date_published": "2022-01-07T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "So you wanna create an eco-friendly website",
      "content_html": "",
      "date_published": "2020-11-25T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "What the Web Still Is",
      "content_html": "",
      "date_published": "2020-11-22T19:07:30-05:00"
    },{
      "id": "https://ericwbailey.design/writing/using-a-folder-other-than-posts-with-eleventy/",
      "url": "https://ericwbailey.design/writing/using-a-folder-other-than-posts-with-eleventy/",
      "title": "Using a folder other than &lt;code&gt;posts/&lt;/code&gt; with Eleventy",
      "content_html": "<p>I just updated this site to use <a href=\"https://www.11ty.dev/\">Eleventy</a>.</p>\n<p>I don’t update <a href=\"https://github.com/ericwbailey/enchilada\">enchilada</a> that much anymore. It’s now more a place to centralize all the little tweaks and gotchas of web work, and less a platform for scaffolding websites.</p>\n<p>In all honestly, enchilada was intended more to be more a simple site generator, and less a blogging platform. I never originally intended for my site to be a blog, but it turns out <a href=\"/writing/\">I enjoy writing</a>, and do it a lot!</p>\n<p>Eleventy was a natural fit for the next iteration of this site. It’s a static site generator allows me to focus on what I want to, namely writing, semantics, and CSS styling. It’s also got <a href=\"https://www.11ty.dev/docs/how-to-support/\">a great community</a> behind it.</p>\n<p>Converting this site was straightforward. It took roughly half a day—most of that was adding metadata for posts on other sites. I did run into one little snag, namely using a directory other than <code>posts/</code> to house my writing.</p>\n<p>Fortunately, the wonderful <a href=\"https://daverupert.com/\">Dave Rupert</a> got me sorted:</p>\n<pre class=\"language-js\"><code class=\"language-js\">module<span class=\"token punctuation\">.</span><span class=\"token function-variable function\">exports</span> <span class=\"token operator\">=</span> <span class=\"token keyword\">function</span><span class=\"token punctuation\">(</span><span class=\"token parameter\">eleventyConfig</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token comment\">// Filter source file names using a glob</span><br>  eleventyConfig<span class=\"token punctuation\">.</span><span class=\"token function\">addCollection</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"posts\"</span><span class=\"token punctuation\">,</span> <span class=\"token keyword\">function</span><span class=\"token punctuation\">(</span><span class=\"token parameter\">collectionApi</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> collectionApi<span class=\"token punctuation\">.</span><span class=\"token function\">getFilteredByGlob</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"writing/*.md\"</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br><span class=\"token punctuation\">}</span><span class=\"token punctuation\">;</span></code></pre>\n<p>How great is that? You can also target multiple directories, so something like <code>getFilteredByGlob([&quot;writing/*.md&quot;, &quot;notes/*.md&quot;])</code> is totally valid. I might poke around with <a href=\"https://www.netlifycms.org/\">Netlify CMS</a> and get <a href=\"https://www.matuzo.at/til/\">a TIL section</a> set up.</p>\n<p>I’m not a developer. I don’t want to wrestle with overwrought Webpack configuration, write GraphQL queries for basic navigation, or scream at types for failing to transpile or whatever. I want to <em>write</em>.</p>\n<p>This is more of the kind of content I want to self-publish: shorter, and more scoped. I still enjoy writing longform (especially about accessibility and inclusive design), but I think that kind of content is best served on other sites where there’s better reach.</p>\n<p>Anyhow, <a href=\"/feed/feed.xml\">this site has a RSS feed</a>, if that’s your thing.</p>\n",
      "date_published": "2020-11-21T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Tailwind versus BEM",
      "content_html": "",
      "date_published": "2020-10-28T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Focus Management and Inert",
      "content_html": "",
      "date_published": "2020-10-18T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Saying no to Diez (for now)",
      "content_html": "",
      "date_published": "2020-09-17T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Consider the Tomato",
      "content_html": "",
      "date_published": "2020-09-07T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/writing/a11y-is-web-accessibility/",
      "url": "https://ericwbailey.design/writing/a11y-is-web-accessibility/",
      "title": "a11y is web accessibility",
      "content_html": "<p>For better or worse, I spend a decent amount of time on social media.</p>\n<p>When you read it regularly, you start to notice that there’s an ebb and flow to the kinds of things that get brought up. People post ideas and observations, followed by reactions, counter-reactions, meta-reactions, subtweets, side and backchannel conversations, etc.</p>\n<p>One observation, “The term ‘a11y’ isn’t very accessible.” seems to pop up like clockwork. Most of the time, I bite my tongue when I see this surface-level remark and move on.</p>\n<p>However, it seems like I stumble across popular web personalities making this observation with increasing frequency. Maybe it’s due to the increased attention accessibility is getting in the design and development spaces. Or maybe it’s due to the filter bubble of who I follow on social media. Regardless, it does seem to be compounding to the point where it compelled me to take action.</p>\n<h2 id=\"what-is-a11y%3F\">What is a11y?</h2>\n<p>First off, we need to establish what a11y is. It is a numeronym that stands for “accessibility.” This isn’t that difficult a thing to figure out—<a href=\"https://www.google.com/search?q=what+does+a11y+mean\">a quick Google search</a> gives us the answers we need. You might not even have to leave your search results page to learn its meaning:</p>\n<p><img\n  alt=\"Google search results for, “what does a11y mean”. The first result a structured data reply, taken from Wikipedia and the article, “What Does A11Y Even Mean?” by Matt D. Smith. It’s description reads, “Accessibility is often abbreviated as the numeronym a11y, where the number 11 refers to the number of letters omitted. This parallels the abbreviations of internationalization and localization as i18n and l10n respectively.” The image comes from Matt D. Smith’s article and shows how the term “a11y” is formed from the word “accessibility.”.\"\n  src=\"/img/posts/a11y-is-web-accessibility/a11y-google-result.png\" /></p>\n<p>Numeronyms aren’t new, nor are they something foreign to the industry. To name a few:</p>\n<ul>\n<li>911</li>\n<li>3D</li>\n<li>d11n</li>\n<li>P2P</li>\n<li>Y2K</li>\n<li>K-9</li>\n<li>l10n</li>\n<li>411</li>\n<li>i18n</li>\n<li>.45</li>\n<li>WWII</li>\n<li>G8</li>\n<li>401(k)</li>\n<li>101</li>\n<li>MST3K</li>\n<li>W3C</li>\n<li>S3</li>\n</ul>\n<p>How many of these terms are you already familiar with? I’m willing to bet a decent amount.</p>\n<h3 id=\"origins\">Origins</h3>\n<p>I don’t know the first person to use the phrase “a11y”, but Twitter’s original character count can be attributed to popularizing it.</p>\n<p>Originally used by accessibility practitioners to save on character count when talking shop, it was <a href=\"https://hackernoon.com/twitter-didnt-invent-the-hashtag-chris-messina-did-1020969abfcd\">further codified as a hashtag</a> when Twitter decided to natively implement a feature that was formed from emergent user behavior—a surprisingly uncharacteristic move for the platform.</p>\n<p>As the tweet length on Twitter was expanded to a luxurious 240 characters, the hashtag stayed on, serving as either a way to continue to save characters, or as a categorical marker to flag tweet content for others.</p>\n<h3 id=\"purpose\">Purpose</h3>\n<p>Thanks to the English language’s adaptable nature, different words can have different connotations depending on the overall context of the sentence they’re placed in. In the context of the categorical marker, a11y serves as disambiguation, the process of making something more clear.</p>\n<p>If I search Twitter for a11y, <a href=\"https://twitter.com/hashtag/a11y?src=hash\">my results are more focused</a> than <a href=\"https://twitter.com/search?l=&amp;q=accessibility&amp;src=typd\">if I search for accessibility</a>. I’m not getting results for courses that make foreign languages more approachable, or how access to public libraries makes research results more rich. I’m not even seeing as much content that deals with accessibility, but at a too high or generalized level.</p>\n<p>a11y neatly sidesteps this issue, which is why we can see examples of its usage outside of Twitter:</p>\n<ul>\n<li>Rob Dodson’s fantastic <a href=\"https://www.youtube.com/playlist?list=PLNYkxOF6rcICWx0C9LVWWVqvHlYJyqw7g\">A11ycasts</a> series, which carries Google’s stamp of approval and currently clocks in at ~90,000 views.</li>\n<li><a href=\"http://pa11y.org/\">Pa11y</a> and <a href=\"https://ryersondmp.github.io/sa11y/\">Sa11y</a>, suites of automated accessibility testing services.</li>\n<li>A worldwide network of conferences, webinars, and meetups attended by thousands of people, including <a href=\"http://conf.a11yto.com/\">a11yTOConf</a>, <a href=\"http://buffa11y.org/\">Buffa11y</a>, <a href=\"https://www.youtube.com/c/accessibilitytalks\">A11Y Talks</a>, <a href=\"https://www.meetup.com/A11yNYC/\">A11yNYC</a>, <a href=\"https://accessibility.scot/\">a11yscotland</a>, <a href=\"https://www.meetup.com/London-Accessibility-Meetup/\">a11ylondon</a>, <a href=\"https://www.meetup.com/A11yBH/\">A11yBH</a>, and <a href=\"https://www.meetup.com/A11y-Meetup-Berlin/\">A11y Meetup Berlin</a>, to name a few.</li>\n<li>A number of podcasts and podcast episodes, including <a href=\"https://a11yrules.com/\">A11Y Rules</a>, the <a href=\"https://frontendhappyhour.com/episodes/a11y-cocktail/\">a11y Cocktail</a> episode of Front End Happy Hour, and the <a href=\"https://changelog.com/jsparty/36\">A11y is your ally</a> episode of JS Party.</li>\n<li>David A. Kennedy’s excellent <a href=\"https://a11yweekly.com/\">A11yWeekly</a> newsletter.</li>\n<li>Carie Fisher’s <a href=\"https://www.bonfire.com/accessibility-cats/\">A11Y Cats</a>, and other accessibility-themed merchandise.</li>\n<li><a href=\"https://www.a11yproject.com/\">The A11Y Project</a>, a website I proudly help maintain.</li>\n<li>etc.</li>\n</ul>\n<p>We don’t use the red dot of light amplification by stimulated emission of radiation to harass our cats. Nor do we check what radio direction and ranging has to say about the day’s weather forecast. When I’m on vacation, I don’t look at tropical fish with the help of a self-contained underwater breathing apparatus. Those tools are lasers, radar, and scuba, three acronyms whose use has become so ubiquitous that they’ve become <a href=\"http://www.chompchomp.com/terms/commonnoun.htm\">common nouns</a>.</p>\n<p>I never see people asking why WWI is written out the way it is, either. Won’t people confuse that with the first Wonder Woman movie? Or the first season of Westworld? Or some new Weight Watchers product? I also never see people questioning technical numeronyms like P2P, S3, or W3C?</p>\n<p>So why do people focus on a11y?</p>\n<h2 id=\"ableism\">Ableism</h2>\n<p>The easy answer is a quick joke about a perceived irony. A more complicated one is internalized ableism.</p>\n<p>To <a href=\"http://cdrnys.org/blog/uncategorized/ableism/\">quote the Center for Disability Rights</a>, ableism is “a set of beliefs or practices that devalue and discriminate against people with physical, intellectual, or psychiatric disabilities and often rests on the assumption that disabled people need to be ‘fixed’ in one form or the other.”</p>\n<p>It’s a pervasive problem, one that’s been <a href=\"https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html\">normalized in our discourse</a> to the point where it’s almost invisible. Think about the last time you called something or someone, “lame,” “stupid,” “crazy,” “retarded,” or “idiotic.”</p>\n<p><a href=\"https://twitter.com/fangirlJeanne/status/1092841801369628674\">Employing more effective adjectives</a> is great. However, removing abelist language, practices, and thoughts involves <a href=\"https://2019.cascadiajs.com/speakers/ej-mason\">listening to individuals</a> who are willing to spend the physical and emotional labor to tell you what needs to be reevaluated.</p>\n<p>Thanks to the internet, that kind of information can be discovered quickly and easily, provided you know the issue exists (oh, if only there was a hashtag to help us).</p>\n<h3 id=\"onus\">Onus</h3>\n<p>I’m nearsighted. I get migraines from time to time, as well as deal with bouts of anxiety and depression. But all things considered, I am an abled, straight, white, cisgender man. So why am I the one telling you all this?</p>\n<p>As alluded to earlier, it is not the responsibility of a <a href=\"https://www.selfdefined.app/definitions/minoritised/\">minoritized</a> group to explain itself to you. Even if these types of questions and observations are asked in entirely good faith, it’s still a Sisyphean task that places a disproportionate burden on the person responding. This isn’t great for any group, especially one that created <a href=\"https://en.m.wikipedia.org/wiki/Spoon_theory\">Spoon theory</a></a>.</p>\n<p>It’s also a common abuse tactic online, where the aggressor asks someone to explain themselves in bad faith, betting on them expending time and effort. Thanks to <a href=\"https://en.m.wikipedia.org/wiki/Problem_of_other_minds\">the problem of other minds</a>, you can never know the intentions on the other end of the conversation.</p>\n<h2 id=\"but-i%E2%80%99m-a-good-person!\">But I’m a good person!</h2>\n<p>You may be thinking this after reading the previous section. And you know what? You probably are. I do think most people strive to do their best.</p>\n<p>If reading about Abelism made you feel uncomfortable, that’s probably a signal that your worldview, and therefore your sense of self are being challenged. And if you made it to this part of the post, great! Sit with your discomfort for a bit and question why you feel this way.</p>\n<p>I’m willing to bet that a non-trivial amount of readers skipped down to the next section, or more realistically, closed the tab when their cognitive dissonance flared as their <a href=\"https://en.m.wikipedia.org/wiki/Mental_model\">mental models</a> were challenged.</p>\n<p>When you say, “The term a11y isn’t very accessible.” are you actually saying that a term that discusses disability needs fixing?</p>\n<p>Subconsciously or consciously, the mental models that construct our world-views can, and do affect and infringe on others. Setting aside <a href=\"https://www.psychestudy.com/social/situational-attribution\">situational attribution</a> for a moment, we need to unpack what “good” is, in the scope of perceiving yourself to be as close to perfect as possible for what society demands of you.</p>\n<p>The thing is: perfect is static, but the world is dynamic. Participating in culture means constantly reevaluating your position in it, and how it affects and is affected by others (see the emergence of <a href=\"https://thebodyisnotanapology.com/magazine/i-am-disabled-on-identity-first-versus-people-first-language/\">identity-first language</a>). This takes work. But consider the alternative.</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">So much of our language is ableist or othering, and we don&#39;t realize it. I see language in accessibility audits like &quot;the screen reader user&quot;, or even heard someone say &quot;these people&quot; when referring to disabled folks in a conference talk about accessibility. <a href=\"https://twitter.com/hashtag/a11y?src=hash&amp;ref_src=twsrc%5Etfw\">#a11y</a>\n&mdash; Nicolas Steenhout (@vavroom) <a href=\"https://twitter.com/vavroom/status/1136774417298542592?ref_src=twsrc%5Etfw\">June 6, 2019</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3 id=\"allyship\">Allyship</h3>\n<p>Allyship is the “<a href=\"https://theantioppressionnetwork.com/allyship/\">active, consistent, and arduous practice of unlearning and re-evaluating</a>, in which a person in a position of privilege and power seeks to operate in solidarity with a marginalized group.”</p>\n<p>You can’t be “the best ally.” It’s not a state to achieve, a switch that’s flipped, a system to rank up in, or a line item on your résumé. Importantly, it’s not a status you can lord over someone else.</p>\n<p>Allyship is an ongoing process where trust, education, and accountability are built with minoritized groups. It takes hard work, but it is well worth the time spent.</p>\n<p>It’s also worth saying that I’m still working at combating my own conscious and unconscious biases and prejudices, especially ones concerning disabilities. I am constantly learning and re-learning about this space, and I am fortunate to be welcomed into it.</p>\n<p>That being said, a11y is a term created by the web worker community and organically adopted by, and rallied behind by its practitioners—both disabled and abled.</p>\n<p>There’s a part of me that feels incredibly uncomfortable writing this post. I write and speak a lot about disability and inclusion, but I do not speak for the group or try to be its savior. To that point, I’ve been trying to <a href=\"https://www.smashingmagazine.com/2020/05/equivalent-experiences-part1/\">incorporate more disabled voices</a> in my work. I don’t want to dominate the conversation, nor force others out who should be present.</p>\n<p>I also want to avoid tone policing. This one is easy: Some disabled people don’t like the term. In this case, you don’t push them to explain their position. Modify your language and behavior to accommodate their stated preference, and feel grateful that they cared enough to tell you. Easy.</p>\n<h2 id=\"criticisms\">Criticisms</h2>\n<p>I should also do my due diligence pointing out some other issues with the term a11y. Most of them have been <a href=\"https://58sound.com/2010/04/16/is-a11y-our-ally-thoughts-on-a-tag-for-web-accessibility/\">brought up by others</a>, but they’re worth resurfacing here.</p>\n<h3 id=\"legibility\">Legibility</h3>\n<p>The term “a11y” looks a lot like the word “ally.” Intentional? Perhaps. Beneficial? I think so.</p>\n<p>If you are concerned there will confusion over what the term will be interpreted as when read, that’s a problem with your typography. If you are empowered to, take the time to <a href=\"https://axesslab.com/fonts-dont-matter/\">update it to be more accessible</a>.</p>\n<h3 id=\"spell-checkers\">Spell checkers</h3>\n<p>Some dictionaries will flag a11y as a misspelled word. They’ll also probably flag many other terms, technical and otherwise. That doesn’t mean they’re not words.</p>\n<p>This topic is a whole post unto itself, but it may be worth thinking about where the words for these dictionaries are sourced, and how they contribute to how we communicate.</p>\n<h3 id=\"it%E2%80%99s-awkward-to-type\">It’s awkward to type</h3>\n<p>If you’re using a software keyboard, switching between alphabetical and numerical keyboards takes effort. This could be especially problematic if you have a motor control disability. However, it’s still less keypresses than typing “accessibility” out in full (6 versus 13 on iOS). Also, when typed enough, many software keyboards will add it to their dictionaries for autocompletion purposes.</p>\n<p>Furthermore, “accessibility” is a long, multisyllabic word. That can make it problematic to read or spell out, especially for people with cognitive concerns.</p>\n<h3 id=\"screen-readers\">Screen readers</h3>\n<p>Some people mention that “a11y” may not be pronounced as expected in a screen reader or narrator? To which I say: that’s exactly the point.</p>\n<p>A screen reader reads the screen the way the person using it has instructed it to. You don’t want to try and overwrite its verbosity and pronunciation settings, as you’d be disrupting someone’s explicit preferences and expectations. Doing so also indirectly communicates that you think that the way they interact with technology is invalid.</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I&#39;ve had web devs ask me if they can control what the screen reader says or which voice or speed it is said in. I said no, and that&#39;s a good thing. All that would achieve is that your users would hate you. <a href=\"https://t.co/UsuAB3Zajv\">https://t.co/UsuAB3Zajv</a>\n&mdash; Geoff Shang (@GShang) <a href=\"https://twitter.com/GShang/status/1292454216099926018?ref_src=twsrc%5Etfw\">August 9, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2 id=\"how-do-i-use-it%3F\">How do I use it?</h2>\n<p>Like a lot of accessibility work, knowing how, when, and why to use the term largely depends on being conscientious of context. It’s also good writing practice.</p>\n<p>Many professions require good communication, and therefore good writing. Copywriters, user researchers, designers, developers, project managers, translators and localizers, marketers, etc, should all be conscious of their audience; their level of experience, their reading level, their areas of expertise, etc.</p>\n<p>For me, a11y is largely a categorical marker. Like a signal flare, I’ll <a href=\"https://twitter.com/ericwbailey/status/1291420275519754245\">append it to tweets</a> when I want to increase the chances of the content being noticed outside of my immediate followers.</p>\n<p>Like any other abbreviation, I observe the <a href=\"https://www.w3.org/TR/UNDERSTANDING-WCAG20/meaning-located.html\">Web Content Accessibility Guideline’s (WCAG) Success Criterion 3.1.4</a>. Like any other acronym or industry jargon, I spell out the term in full the first time it appears in my writing, then follow it up with the acronym it represents:</p>\n<blockquote>\n  <code>Accessibility (&lt;abbr&gt;a11y&lt;/abbr&gt;)</code>\n</blockquote>\n<p>As it is industry jargon, I try to be aware of the context and known level of cognition my writing will ultimately wind up in. If it is for peers, the term might be used casually, alongside other jargon like AT, DOM, AA, JSON, etc.</p>\n<h2 id=\"how-do-i-not-use-it%3F\">How do I not use it?</h2>\n<p>If it’s for an audience who is new to working on the web, including learning about accessibility, I will probably not use the term until they feel more acquainted with the space.</p>\n<p>I also don’t try to slap it in to replace the term “accessibility.” Sentences like, “Make the best a11y on your website with these 5 tips” feel forced and artificial.</p>\n<h2 id=\"a11y-is-here-to-stay\">a11y is here to stay</h2>\n<p>The genie is out of the bottle. The ship has sailed. The egg is scrambled.</p>\n<p>If you’re a popular personality on social media, it’s worth some self-reflection about the ripple effect of making this observation about a11y’s perceived obtuseness.</p>\n<p>By leaping to score some quick clever points, you’re also signaling that some negative behaviors are acceptable to model: namely gatekeeping, scapegoating, and most importantly, denying the self-disclosed identity and viewpoints of a minoritized group.</p>\n<p>I’m less concerned about this as your private opinion voiced publicly than I am about what your legions of followers will think and do after reading it.</p>\n<p>There’s already enough <a href=\"https://twitter.com/MollyWattTalks/status/1086607258656653319\">horrible misconceptions about disability</a> out there, we don’t need any more. If you’re reaction here is to think, “Well, <em>you’re</em> the one gatekeeping in telling me what I can’t say!” I’d ask you to reread the “But I’m a good person!” section.</p>\n<p>I’m not naïve enough to think this will close discussion on the topic, but I do hope this article is something you can send as a reply to the next person who gets all fired up to make this kind of tiresomely pithy observation.</p>\n<p>If you’ve been sent this post, why not turn your energies towards something more constructive? <a href=\"https://developers.google.com/web/tools/lighthouse/#devtools\">Auditing your site for accessibility issues</a> is a good place to start. Even better: use that time to read, and to listen.</p>\n",
      "date_published": "2020-08-09T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "The world does not revolve around your product",
      "content_html": "",
      "date_published": "2020-08-05T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/writing/mug-handles/",
      "url": "https://ericwbailey.design/writing/mug-handles/",
      "title": "Mug handles",
      "content_html": "<p><a href=\"https://www.smashingmagazine.com/2020/05/equivalent-experiences-part1/\">My two-part piece on equivalent experiences</a> is now live on Smashing Magazine. I have complicated feelings about it.</p>\n<p>First off, writing for Smashing Magazine is a great experience, and <a href=\"https://www.smashingmagazine.com/write-for-us/\">I encourage you (yes, you) to pitch them</a>. Their team is friendly, knowledgeable, and will help make your writing the best it can be.</p>\n<p>I am also happy to see their <a href=\"https://www.smashingmagazine.com/2020/06/black-lives-matter/\">leadership publicly acknowledging the Black community</a>, as well as a continued investment in giving underrepresented voices a platform. I do feel uncomfortable being the next featured homepage article—I am a straight, white, cisgendered abled male. As someone who researches, and believes in <a href=\"https://en.m.wikipedia.org/wiki/Intersectionality\">Intersectionality</a>, it has given me a lot to sit with.</p>\n<p>Our industry has settled on a <a href=\"https://kottke.org/17/03/the-satirical-origins-of-the-meritocracy\">meritocratic monoculture</a>. It is a default that has <a href=\"https://twitter.com/donavon/status/1135520568990720001\">a deep white savior / hero worship problem</a>, <a href=\"https://github.com/facebook/react\">born of privilege</a> in a <a href=\"https://www.nytimes.com/2018/10/15/technology/myanmar-facebook-genocide.html\">genocide engine</a> so <a href=\"https://www.theverge.com/2020/5/26/21270659/facebook-division-news-feed-algorithms\">willfully ignorant</a> of its own power that it <a href=\"https://www.theverge.com/2019/3/28/18285178/facebook-hud-lawsuit-fair-housing-discrimination\">independently reinvented redlining</a> and thought it was a good thing.</p>\n<p>Smashing Magazine, as well as <a href=\"https://css-tricks.com/guest-posting/\">CSS-Tricks</a>, represent an important space in the industry. They are perceived as authoritative sources, while also publishing a range of thought, experience, and technology approaches. This is much-needed when considering the alternative—I hope they continue to do their part in pushing for better representation.</p>\n<p>A byline at either publication grants leverage and clout, especially in <a href=\"https://www.mic.com/articles/156689/minorities-in-tech-discrimination-recruiting-best-practices-how-to-recruit-job-interview-tips\">a hiring context</a>. For my part, I think it is best to step back for awhile to allow others the opportunities offered to me. I will also be doing my part to amplify <a href=\"https://www.selfdefined.app/definitions/minoritised/\">minoritized</a> voices, something I am really excited for. I may still occassionally publish here, as it is a personal website—I just don’t plan to be vocal about it.</p>\n<h2 id=\"the-piece-itself\">The piece itself</h2>\n<p>The need for equivalent digital experiences is a message that needs to be said. It’s been said before by people other than me, but it bears repeating. It especially needs to be said now. We’re both <a href=\"https://themarkup.org/2020/04/21/blind-users-struggle-with-state-coronavirus-websites\">requiring more software to survive in the modern world</a>, while paradoxically <a href=\"https://webaim.org/projects/million/\">making it more inaccessible than it’s ever been before</a>.</p>\n<p>I’m glad Smashing Magazine published it. Their borrowed authority is much-needed in the accessibility space. They also give the concept of digital accessibility exposure, something that’s important to remember if you’re as dialed into the community as I am.</p>\n<p><a href=\"https://en.m.wikipedia.org/wiki/Filter_bubble\">Filter bubbles</a> are very real, and it’s important to remind myself that this article might be someone’s first exposure to the concept of accessibility, even someone who’s been working in the industry for a while.</p>\n<h3 id=\"direction\">Direction</h3>\n<p>I’m not content with where the piece wound up. Right now I view it as a flip on common “intro to accessibility” posts. After interviewing many self-identified disabled people, the focus evolved to common remediation advice organized by reported barriers, rather than the more common pattern of organizing by domain.</p>\n<p>Don’t get me wrong: these introductory posts are vital sources of information to get people aware and pointed in the right direction. However, the repeating of this information signals to me that <a href=\"/posts/fighting-uphill/\">we’re still categorically failing disabled people in basically every way possible</a>. The interviews confirmed it.</p>\n<p>I originally wanted to discuss the nuance in how <a href=\"https://medium.com/aaptiv-engineering/lessons-in-ios-voiceover-accessibility-834c5ed9a374\">something that’s technically accessible may not be considered usable</a>. The <a href=\"https://www.smashingmagazine.com/2020/05/equivalent-experiences-part1/#accessible-experiences-aren-t-necessarily-equivalent-ones\">Rube Goldberg machine metaphor</a> I use is a thread of that original line of thinking.</p>\n<p>This phenomenon is what you might experience when someone tries to retroactively “fix” something, oftentimes by <a href=\"https://a11yproject.com/posts/aria-has-perfect-support/\">applying massive amounts of untested ARIA</a> to it. Another good example is page/view titles, alternative descriptions, and <a href=\"https://adrianroselli.com/2019/10/stop-giving-control-hints-to-screen-readers.html\">accessible names that over-explain</a>—a decision that creates an infantilizing experience:</p>\n<figure role=\"figure\" aria-label=\"If I find you doing this I will invite you to a Zoom call to yell at you.\">\n<pre><code>&lt;title&gt;\nOn this page you can send money between individual domestic or international accounts, and other banks. Click the Transfer button to get started.\n&lt;/title&gt;\n…\n&lt;h1&gt;\nTransfer funds\n&lt;/h1&gt;\n</code></pre>\n  <figcaption>\n    If I find you doing this I will invite you to a Zoom call to yell at you.\n  </figcaption>\n</figure>\n<p>Assistive-technology experiences can have a range of quality in their interactions, and it seems like functioning ones are rare enough, but good ones are virtually non-existent. This is <a href=\"https://neustadt.fr/essays/against-a-user-hostile-web/\">sadly, ironically equivalent to many other modern web experiences</a>.</p>\n<h3 id=\"function-follows-form\">Function follows form</h3>\n<p>I had an amazing conversation with <a href=\"https://linktr.ee/uxicorn\">Soren</a>, someone I was fortunate to be able to meet via doing the research for my equivalent experiences piece. In this conversation, I expressed my frustrations about what I originally wanted versus where I wound up. They replied with an amazing insight, paraphrasing <a href=\"https://mitpress.mit.edu/books/design-everyday-things\"><cite>The Design of Everyday Things</cite></a>:</p>\n<blockquote>\n  A mug handle becomes this universal thing, where people wrap a tea bag around it. […] This becomes something universal, that we don’t realize until we start observing it. We think maybe it’s maybe anecdotal, but it’s actually something that happens in the wild because of the form of the item.\n</blockquote>\n<p>Wow.</p>\n<p>I took ~6,300 words to say what Soren captured in one powerful statement. <strong>Equivalency is an after-effect, informed by how our tools shape us</strong>.</p>\n<h2 id=\"the-voiceover-selfie-challenge\">The VoiceOver selfie challenge</h2>\n<p>Mug handles are an analog example, so I thought I’d also provide a digital one. It’s my hope this helps communicate the point I was trying to get at by providing something practical and grounded that you can try out for yourself.</p>\n<p>I’m not sure who came up with the idea of the VoiceOver selfie challenge. The earliest source I could find was from <a href=\"https://www.slideshare.net/JasonDThompson/voice-over-selfie-challenge\">Aidan Tierney and Jason Thompson</a> in 2017, but I think I remember hearing about it before then.</p>\n<p>To take a selfie on your iOS device using <a href=\"https://support.apple.com/guide/iphone/turn-on-and-practice-voiceover-iph3e2e415f/ios\">VoiceOver</a>, you need to:</p>\n<ol>\n<li>Go to Settings.</li>\n<li>Go to General.</li>\n<li>Go to Accessibility.</li>\n<li>Go to Accessibility Shortcut.</li>\n<li>Set Triple-click Home to VoiceOver.</li>\n<li>Triple click Home and activate VoiceOver.</li>\n<li>Go to the home screen.</li>\n<li>Use swiping and tapping to navigate via VoiceOver to the Camera app and open it.</li>\n<li>Navigate via VoiceOver to the button that flips the Camera around.</li>\n<li>Rotate the device until VoiceOver announces, “One face, centered.”</li>\n<li>Navigate via VoiceOver to the button that takes a photo.</li>\n</ol>\n<p>Alternatively, you could:</p>\n<ol>\n<li>Activate <a href=\"https://support.apple.com/en-us/HT210417\">Voice Control</a>.</li>\n<li>Activate Siri.</li>\n<li>Tell Siri to “Take a selfie.”</li>\n<li>Say, “Tap take picture.”</li>\n</ol>\n<p>You could also:</p>\n<ol>\n<li>Activate Siri.</li>\n<li>Tell Siri to “Take a selfie.”</li>\n<li>Press the top volume rocker.</li>\n</ol>\n<p>The original intent of the challenge is to get people aware of, and familiar with using VoiceOver. However, iOS devices are mugs with a lot of handles—the other two techniques are “ah-ha!” moments to help teach you that these experiences can be easy, intuitive, and pleasant.</p>\n<h3 id=\"multiple-ways\">Multiple ways</h3>\n<p>This is a phenomenal example of what the spirit of <a href=\"https://www.w3.org/TR/UNDERSTANDING-WCAG20/navigation-mechanisms-mult-loc.html\">WCAG Success Criterion 2.4.5 Multiple Ways</a> is getting at. iOS takes advantage of its multiple input modes to thread in many different ways to navigate and activate things.</p>\n<p>Sometimes it’s easier and faster to use accessibility technologies to get what you want, even if you don’t have a disability. It’s a great lesson in <a href=\"https://inclusivedesignprinciples.org/\">Inclusive Design</a>.</p>\n<p>iOS incorporates deep, sophisticated accessibility tooling, for those who need it. It is also largely unopinionated about how to go about doing what you need to do, and preserves core interaction metaphors regardless of past, current, or future <a href=\"https://en.m.wikipedia.org/wiki/Modality_(human%E2%80%93computer_interaction)\">input modality</a>. It doesn’t force you to adopt a preconceived persona of what it considers a “disabled person,” conforming your behavior to the model it deems appropriate.</p>\n<p>This might sound sententious, but it just works.</p>\n<p>Disability personas are a <a href=\"https://en.m.wikipedia.org/wiki/Category_mistake\">category error</a>. They tokenize and trivialize lived experiences, and are easy for an organization to ignore when they seem inconvenient. In addition, they are often crafted without input from actual disabled people.</p>\n<p>When building digital experiences, I have two asks:  First is to consider exactly what kind of mug you’re building. Second is to <a href=\"https://www.gatsbyjs.org/blog/2019-07-11-user-testing-accessible-client-routing/\">ask the person who drinks out of it what they think</a>.</p>\n",
      "date_published": "2020-08-05T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Improving the usability and accessibility of a healthcare website by being mindful of reading level",
      "content_html": "",
      "date_published": "2020-08-05T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "I don’t want your job",
      "content_html": "",
      "date_published": "2020-07-20T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Equivalent Experiences: Thinking Equivalently",
      "content_html": "",
      "date_published": "2020-06-04T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Equivalent Experiences: What Are They?",
      "content_html": "",
      "date_published": "2020-05-26T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "A Complete Guide to CSS Functions",
      "content_html": "",
      "date_published": "2020-05-26T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Myth: ARIA Has Perfect Support",
      "content_html": "",
      "date_published": "2020-05-12T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "SVG, Favicons, and All the Fun Things We Can Do With Them",
      "content_html": "",
      "date_published": "2020-04-23T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/writing/how-to-not-make-a-resume-in-react/",
      "url": "https://ericwbailey.design/writing/how-to-not-make-a-resume-in-react/",
      "title": "How to not make a résumé in React",
      "content_html": "<p>I’ve seen a fair share of tutorial links floating around in newsletters and Twitter and the like recently. They all promise the same thing, namely how to use React to create a résumé.</p>\n<p>I mean, I get it. It’s important to have something to build towards when learning a new skill, especially with development.</p>\n<p>At first blush a résumé seems like a good thing to build towards: They are relatively small in terms of complexity and can probably use content that already exists on your LinkedIn profile. If you’re looking for a job, it’s also a handy way to double-dip on a skill that is in high demand.</p>\n<p>I checked out a few of these tutorials, and after noticing some patterns, I’d like to mention a few things you could do to your résumé instead. I’m not going to link to the ones I tested because I don’t want to give bad advice more exposure than it is already getting.</p>\n<h2 id=\"use-semantic-markup\">Use semantic markup</h2>\n<p>Each of the tutorials I audited did a terrible job at markup. Correlation isn’t causation, but there has to be something to the fact that <a href=\"https://webaim.org/projects/million/#frameworks\">framework-utilizing homepages show a greater degree of detectable accessibility errors when compared to non-framework utilizing homepages</a>.</p>\n<p>Rock-solid, semantic HTML markup is the foundation that you build the rest of your experience from. In the context of a résumé, the lack of semantically-described content would tell me:</p>\n<ol>\n<li>You don’t know about these foundational skills, or</li>\n<li>Don’t care about why they’re important.</li>\n</ol>\n<p>This might sound harsh, but in the tech world this would be the equivalent of handing in a résumé printed on colored construction paper. Consider that there’s a decent chance someone doing the hiring may be checking your work out with this level of detail, as it's an example of what level of craft you’ll be bringing to their team.</p>\n<h3 id=\"how-to-do-it\">How to do it</h3>\n<p>What you want to do is familiarize yourself with <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element\">the HTML elements made available to us</a>.</p>\n<h4 id=\"your-content\">Your content</h4>\n<p>We want to <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/p\">use paragraph elements</a> for content such as your summary statement. <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/a\">Anchor elements</a>—not clickable <code translate=\"no\">div</code>s—allow you to link out to pertinent information such as your GitHub profile, personal website, email address, and <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/a#Linking_to_telephone_numbers\">even your phone number</a>. If you’re looking for a job, making yourself easy to get in contact with is a good thing.</p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ul\">Unordered lists</a> can help with the listing of skills an accomplishments, and <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ol\">ordered lists</a> can help with timelines. Wrapping accomplishments in <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/strong\"><code translate=\"no\">strong</code> elements</a>—not spans—can call attention to important career milestones.</p>\n<h4 id=\"how-to-prioritize-it\">How to prioritize it</h4>\n<p>First, you’ll want to <a href=\"https://webdesign.tutsplus.com/articles/the-importance-of-heading-levels-for-assistive-technology--cms-31753\">use heading elements to structure your content</a> in a way that makes sense hierarchically. For a common résumé format, it’d be something like.</p>\n<ol>\n  <li><code translate=\"no\">h1</code> Your name\n    <ol>\n      <li><code translate=\"no\">h2</code> Personal information</li>\n      <li><code translate=\"no\">h2</code> Summary statement</li>\n      <li><code translate=\"no\">h2</code> Work experience\n        <ol>\n          <li><code translate=\"no\">h3</code> Job title and company</li>\n        </ol>\n      </li>\n      <li><code translate=\"no\">h2</code> Skills</li>\n      <li><code translate=\"no\">h2</code> Education\n        <ol>\n          <li><code translate=\"no\">h3</code> School name</li>\n        </ol>\n      </li>\n    </ol>\n  </li>\n</ol>\n<p>This structure clearly communicates:</p>\n<ol>\n<li>Who you are</li>\n<li>How I can contact you</li>\n<li>What you’re looking for</li>\n<li>What you’ve done previously</li>\n<li>How you did it</li>\n<li>Who taught you</li>\n</ol>\n<p>Since this helps me quickly and clearly understand you as a candidate, I can easily dip into those third level headings to really dig into the nitty-gritty.</p>\n<h4 id=\"how-to-section-it\">How to section it</h4>\n<p>You’ll also want to <a href=\"https://web.dev/use-landmarks/\">use HTML’s landmark elements</a> to divide up your content. Use <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/header\">the <code translate=\"no\">header</code> element</a> for your name and summary, <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/main\">the <code translate=\"no\">main</code> element</a> to describe your skills, work history, education, etc. The <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/aside\"><code translate=\"no\">aside</code> element</a> can house your contact information, since it’s only pertinent if the person reviewing your résumé likes what they’re reading.</p>\n<h3 id=\"why-should-i-care%3F\">Why should I care?</h3>\n<p>In addition to making the document easier to scan through in code, it helps people who use specialized technology to help them sift through applicant’s résumés. Some of this technology might be assistive technology such as a screen reader, but it could be any number of other things.</p>\n<p>Hoppers, scrapers, translators, and other automated solutions are commonplace tools for many HR departments. Semantic HTML is <a href=\"https://en.m.wikipedia.org/wiki/Web_interoperability\">interoperable</a> HTML. It can maintain meaning when translated to another medium—say some choice information copy and pasted into an email sent to a decision-maker.</p>\n<p>Need a little more convincing? <a href=\"https://medium.com/@brentonhenry/its-2019-and-outlook-is-still-rendered-with-word-675ca1a5d1a0\">Outlook uses Microsoft Word to render email</a>. Making your content simple and straightforward will do wonders when something that absurd, yet so important is in play.</p>\n<p>The point is, you don’t know how someone will be interacting with your résumé, or what they’ll be doing with it, so you want to make sure it is as robust as possible when putting it out for the world to see.</p>\n<h2 id=\"make-it-portable\">Make it portable</h2>\n<p>Make your résumé analogous to its printed counterpart. By this, I mean a self-contained document. Don’t hotlink to external resources—this includes fonts, images, and JavaScript libraries and <a href=\"https://polyfill.io/\">polyfills</a>.</p>\n<p>Inline as much as possible into <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/head\">your document’s <code translate=\"no\">head</code></a>. This includes <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/style\">your CSS</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script\">your JavaScript</a>. Images can be <a href=\"https://www.base64-image.de/\">converted to Base64</a>, and <a href=\"https://jakearchibald.github.io/svgomg/\">SVG can be inlined</a>.</p>\n<p>Normally <a href=\"https://calendar.perfplanet.com/2011/why-inlining-everything-is-not-the-answer/\">this is bad advice</a>. However, when everything is self-contained in a single file, that file becomes incredibly fault-tolerant, cacheable, and compact. It can be saved locally and passed around confidently, with almost no failure points.</p>\n<p>As résumés are mostly text and really shouldn’t have much in the way of interactivity, there’s also a good chance you can get the whole thing to <a href=\"https://www.afasterweb.com/2015/05/26/latency-and-the-first-round-trip#the-first-14k\">render within the first round trip</a>.</p>\n<h2 id=\"make-it-printer-friendly\">Make it printer-friendly</h2>\n<p>This one is easy. Webpages can, and will be printed. <a href=\"https://www.smashingmagazine.com/2015/01/designing-for-print-with-css/\">CSS can style printed pages</a>. CSS supports <a href=\"https://developer.mozilla.org/en-US/docs/Learn/CSS/Building_blocks/Values_and_units#Absolute_length_units\">absolute measurement units</a>. When that HR manager inevitably prints your résumé to show someone, make sure it shows up looking <em>good</em>.</p>\n<h2 id=\"make-it-machine-friendly\">Make it machine-friendly</h2>\n<p>In addition to semantic markup, you can enhance your document with <a href=\"https://schema.org/\">Schema.org microdata</a>.</p>\n<p>When scraping and search services such as Google index a website, they use complicated code to “best guess” what the website is about.</p>\n<p>By using microdata, you are able to speak directly to this code and say, “This is what this content means.” Removing this ambiguity means <a href=\"https://search.google.com/structured-data/testing-tool/u/0/\">showing up for relevant searches</a> becomes that much easier for all involved.</p>\n<p><a href=\"http://Schema.org\">Schema.org</a> has <a href=\"https://schema.org/Person\">a way to programmatically describe yourself</a>. It also has a way to communicate <a href=\"https://schema.org/Organization\">organizations</a>, <a href=\"https://schema.org/Event\">events</a>, and <a href=\"https://schema.org/Product\">products</a>. I don’t know about you, but those all seem to me like things you’d commonly find on résumés.</p>\n<h2 id=\"make-it-responsive\">Make it responsive</h2>\n<p>You want your résumé to look good on a device the same way you want it to look good when printed. Since you can’t know the circumstances where it’ll be viewed, make sure you start with <a href=\"https://bradfrost.com/blog/post/mobile-first-responsive-web-design/\">a mobile-first mindset</a> and test how it looks on a variety of screen sizes.</p>\n<p>It’s easy to imagine a scenario where an overworked hiring manager is reviewing your résumé on their phone over a lunch break. It’s also not too far a stretch to envision a scenario where it’s loaded onto a large conference room TV to discuss.</p>\n<h2 id=\"make-it-performant\">Make it performant</h2>\n<p>You probably won’t need to worry about this point if you follow the rest of this article’s advice. It is, however, something to think about if you are using React or many other JavaScript SPA frameworks.</p>\n<p>JavaScript uses the main thread to run, which means it blocks other things the browser needs to do. This includes painting, reflows, and garbage collection—all of which are used to show the person trying to load your website the website’s content.</p>\n<p>Things like a <a href=\"https://reactjs.org/docs/faq-internals.html\">virtual DOM</a> and <a href=\"https://adactio.com/journal/16404\">hydration</a> are JavaScript-intensive and offset that burden on the end user. On a powerful computer, say one used for developing, this isn’t too much of a concern.</p>\n<p>On a less powerful device, say a locked down, provisioned, bulk-ordered budget company Dell laptop <a href=\"https://gs.statcounter.com/browser-market-share/desktop/united-states-of-america#monthly-201801-202003\">still running Internet Explorer</a>, this privilege may not exist. Do you want your résumé to be the thing that crashes a prospective employer’s browser?</p>\n<h2 id=\"be-critical\">Be critical</h2>\n<p>Consider what React and other SPA frameworks are good for: stateful, extensible, component-driven applications. Now consider what a résumé’s goals are.</p>\n<p>Not every problem <a href=\"https://en.m.wikipedia.org/wiki/Law_of_the_instrument\">requires a hammer</a>. Part of being a good developer is being able to pick the right tool for the job. Being able to weigh a technology’s strengths against its weaknesses, and articulate them, are incredibly valuable skills.</p>\n<p>While React and its ilk definitely are capable of performing much of what I discussed, it is not what they are focused on. As such, the time you’d spend on these considerations needs to compete with the time you’ll need to invest to setting up and working in your framework of choice.</p>\n<p>Just because the job market is demanding a certain buzzword doesn’t mean you can’t be critical of its faults and limitations. It also doesn’t mean that buzzword will be in favor forever—today’s React might become yesterday’s <a href=\"https://thenewstack.io/gopher-ruled-internet/\">Gopher</a>.</p>\n<p>Résumés are all about making yourself seem attractive to a potential employer, demonstrating what skills and abilities you can offer their organization. All the enhancements described above signal depth of knowledge and consideration of circumstance, which goes a long way to standing out and getting that first interview lined up.</p>\n",
      "date_published": "2020-04-06T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Using personas in the Product Design Sprint",
      "content_html": "",
      "date_published": "2020-03-03T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Operating System and Browser Accessibility Display Modes",
      "content_html": "",
      "date_published": "2020-01-22T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/writing/tech-metaphors/",
      "url": "https://ericwbailey.design/writing/tech-metaphors/",
      "title": "Tech metaphors",
      "content_html": "<p>Tired of referencing the same yaks, sheds, and cars over and over again? Here’s a few new metaphors to drop at your next sprint planning meeting:</p>\n<h2 id=\"winchester-mystery-house\">Winchester Mystery House</h2>\n<p>A mansion in San Jose, California that was once occupied by Sarah Winchester, widow of the eponymous firearms manufacturer. The mansion is known for its size, the fact that it was under constant construction for 38 years, and the lack of any master building plan.</p>\n<p>The mansion started as an unfinished farmhouse and was a seven-story building at the time of Sarah’s death, at which point construction stopped. As she did not have an architect directing construction, the mansion contains many odd features implemented seemingly at random, including doors that lead to nowhere, non-standard-sized stairs, and windows opening into other rooms.</p>\n<h2 id=\"hallucigenia-sparsa\">Hallucigenia sparsa</h2>\n<p>An extinct, thumb-sized worm from the Cambrian period. For the longest time, scientists didn't know which end was up or front. Nobody denied that it existed, just how it did what it did.</p>\n<h2 id=\"cadaver-synod\">Cadaver Synod</h2>\n<p>Pope Formosus was put on trial for perjury by the successor to his successor, Pope Boniface VI. Formosus was accused of prejury and on becoming Pope illegally.</p>\n<p>The rub? Pope Formosus had been dead and buried for a year before his accusation. His corpse was exhumed and brought to court for trial at Papal Court. A deacon was instructed to answer for the Pope’s propped-up corpse, with many of the questions coming from political enemies of the Pope’s family.</p>\n<p>Formosus was found guilty, stripped of his vestments, and had his papacy retroactively declared null.</p>\n<h2 id=\"jefferson-bible\">Jefferson Bible</h2>\n<p>Officially titled <cite>The Life and Morals of Jesus of Nazareth</cite>, the Jefferson Bible is a religious book constructed by Thomas Jefferson by cutting select passages from the gospels of Matthew, Mark, Luke, and John from the King James Version. Jefferson picked, pasting them together to form a narrative better aligned to his worldview.</p>\n<h2 id=\"wan-hu%E2%80%99s-chair\">Wan Hu’s Chair</h2>\n<p>This is an apocryphal story about a Wan Hu, an alleged Ming dynasty official. Hu, desiring to reach the moon, attached forty-seven gunpowder rockets to a large wicker chair. He then sat on the chair and instructed forty-seven subordinates to ignite the rocket’s fuses. There was a massive explosion. When the smoke cleared, both the chair and Wan Hu were nowhere to be found.</p>\n<h2 id=\"baby-centrifuge\">Baby centrifuge</h2>\n<p>A patent granted to George and Charlotte Blonsky in 1965. The device is described as being a circular table that a woman is strapped into, lying on her back. The table then rotates at a high speed, pushing the baby out via centrifugal force into netting wrapped around the woman’s legs.</p>\n<p>While horrific sounding, the Blonsky’s invention came from a place of (misguided) compassion. The couple loved children, and the idea for their invention came from observing difficulties with an elephant giving birth at a local zoo.</p>\n<p>The inspiration for the actual implementation likely came from a famous device at the time: the centrifuges used to train astronauts for exposure to high-g environments. However, this misapplication of unrelated technology to facilitate delivery was judged as being both overly-expensive and complicated compared to existing birthing methods.</p>\n<p>Finally, the net was evaluated as being unsuited to the task of safely catching the ejected baby, making the entire point of the device moot.</p>\n",
      "date_published": "2019-11-10T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/writing/truths-about-digital-accessibility/",
      "url": "https://ericwbailey.design/writing/truths-about-digital-accessibility/",
      "title": "Truths about digital accessibility",
      "content_html": "<p>Creating, maintaining, or evaluating accessible technology? Here are some things to keep in mind (note that <a href=\"https://thebodyisnotanapology.com/magazine/i-am-disabled-on-identity-first-versus-people-first-language/\">identity-first language</a> is intentional):</p>\n<h2 id=\"each-screen-reader-behaves-differently\">Each screen reader behaves differently</h2>\n<p>This is by design. Behavior is a balancing act between a screen reader’s features, the requirements of the operating system it is installed on, the <a href=\"https://en.m.wikipedia.org/wiki/Form_factor_(design)\">form factor</a> it is available in, and the types of input it can receive.</p>\n<p>Each screen reader also has different interaction modes. These modes help the people who use them to understand, navigate, and take action on digital content in the way that is the most effective for them. <a href=\"https://webdesign.tutsplus.com/articles/the-importance-of-heading-levels-for-assistive-technology--cms-31753\">Generating a list of all headings elements</a>, links, or <a href=\"https://www.scottohara.me/blog/2019/04/05/landmarks-exposed.html\">landmarks</a> are all examples of what these modes can be.</p>\n<p>Modes are activated in different ways, depending on both the form factor and version of the screen reader being used. For example, VoiceOver on iOS can navigate between lists by swiping when <a href=\"https://support.apple.com/en-us/HT204783\">the Rotor</a> is set to navigate via lists. In comparison, <a href=\"https://www.freedomscientific.com/products/software/jaws/\">JAWS</a> uses the <kbd>L</kbd> key on a keyboard to do the same. Many of these modes can also be activated in <a href=\"https://www.w3.org/TR/UNDERSTANDING-WCAG20/navigation-mechanisms-mult-loc.html\">multiple ways</a>, such as a keyboard shortcut, macro, voice command, or gaze dwell duration.</p>\n<h2 id=\"screen-readers-are-more-than-just-voiceover\">Screen readers are more than just VoiceOver</h2>\n<p>Windows may not be your primary operating system. However, chances are good it will be for <a href=\"https://webaim.org/projects/screenreadersurvey7/#primary\">the people who rely on screen readers</a>. Because of this, it is vital to include JAWS and <a href=\"https://www.nvaccess.org/\">NVDA</a>, the two most popular Windows screen readers, in your tests.</p>\n<p>It’s also worth pointing out here that the desktop and mobile versions of VoiceOver are separate apps, each with its own <a href=\"https://bugs.webkit.org/show_bug.cgi?id=196354\">bugs and quirks</a> to work around. Don’t get me wrong: Apple bundling a powerful, sophisticated screen reader into its desktop and mobile operating systems has done a ton for normalizing access, and the world is better off for it.</p>\n<h2 id=\"not-all-screen-reader-users-are-blind\">Not all screen reader users are blind</h2>\n<p>This fact is <a href=\"http://adrianroselli.com/2017/02/not-all-screen-reader-users-are-blind.html\">quite nicely elaborated on by Adrian Roselli</a>.</p>\n<p>If you don’t read his post, one of the more important takeaways is ensuring there is parity between your user interface components’ text labels and what is announced by screen readers (while still respecting someone’s screen reader <a href=\"https://en.m.wikipedia.org/wiki/Screen_reader#Verbosity\">verbosity settings</a>). A discrepancy between the two will most likely create a confusing and disorienting experience.</p>\n<p>There is also an elegant, inclusive aspect to maintaining this parity. By not making assumptions about a screen reader user’s circumstances, we don’t unintentionally create separate experiences for them.</p>\n<p>Anecdotally, my only vision concern is some mild nearsightedness, but I love using <a href=\"https://www.idownloadblog.com/2016/02/29/mac-speak-selected-text/\">macOS’ speak selected text feature</a> as a way of keeping myself honest when reading my writing out loud to myself when proofreading. This feature is effectively a simplified screen reader, similar to <a href=\"https://support.microsoft.com/en-us/help/22798/windows-10-complete-guide-to-narrator\">Microsoft Narrator</a>.</p>\n<h2 id=\"assistive-technology-is-more-than-screen-readers\">Assistive technology is more than screen readers</h2>\n<p>Wheelchairs, canes, <a href=\"https://www.healthproductsforyou.com/c-head-pointers-and-mouth-sticks.html\">head pointers and mouth sticks</a>, <a href=\"https://www.24a11y.com/2018/i-used-a-switch-control-for-a-day/\">switches</a>, <a href=\"https://en.m.wikipedia.org/wiki/Sip-and-puff\">sip-and-puff devices</a>, eyeglasses, <a href=\"https://bltt.org/keyboards-for-disabled-people/\">adaptive keyboards</a>, <a href=\"https://www.tobiidynavox.com/en-us/about/about-us/how-eye-tracking-works/\">eye trackers</a>, <a href=\"https://en.m.wikipedia.org/wiki/Refreshable_braille_display\">refreshable braille displays</a>, adaptive grips, ramps, grab bars, prosthetics, voice command, <a href=\"https://en.m.wikipedia.org/wiki/Screen_magnifier\">screen magnifiers</a>, hearing aids, memory aids, etc. The list goes on.</p>\n<p>Many of these devices now (<a href=\"https://www.healthline.com/diabetesmine/omnipod-smartphone-control-diabetes\">or soon will</a>) incorporate a computer, and/or interface with other digital technology. These devices rely on <a href=\"https://alistapart.com/article/semantics-to-screen-readers/\">the Accessibility Tree</a>—the mechanism computers use to allow assistive technology to programmatically read and interpret user interface content—to function.</p>\n<p>I would also be remiss if I didn’t mention <a href=\"https://css-tricks.com/reader-mode-the-button-to-beat/\">specialized browsing modes</a>, or <a href=\"http://bradfrost.com/blog/post/accessibility-and-low-powered-devices/\">devices that have been repurposed to serve as assistive technology</a>.</p>\n<h2 id=\"assistive-technology-may-not-be-running-on-high-powered-devices%2C-or-be-running-the-latest-software\">Assistive technology may not be running on high-powered devices, or be running the latest software</h2>\n<p>There are four factors to consider here, and these factors are not necessarily mutually exclusive:</p>\n<p>First is that disabled people are discriminated against in many areas, especially employment. A lack of access to good-paying jobs also means less income to spend on high quality devices. A lack of high quality devices means lower-powered hardware.</p>\n<p>Second is that assistive technology may be running on a lower-power device due to the device’s form factor. Here, size requirements may mandate that there won’t physically be any extra space to put larger, more powerful hardware. This requirement sometimes stems from a desire to diminish the device’s profile, and therefore lessen chances of stigmatization by its use in public—think <a href=\"https://www.healthyhearing.com/report/47717-Digital-hearing-aid-history\">the evolution of the hearing aid</a>.</p>\n<p>Some, but not all devices get around this limitation by offloading their computational needs on another device, say <a href=\"https://www.truhearing.com/more-resources/amazing-benefits-smartphone-hearing-aids/\">a hearing aid that pairs with a smartphone</a>. While this does let a lower-power device do things it normally couldn’t on its own, the device is still limited by what is allowed by both the operating environment and the communication protocols it utilizes. For example, Bluetooth Low Energy clocks in at ~0.27 Mbps, which imposes a pretty severe bottleneck on how much information can be transmitted at any given moment.</p>\n<p>Third, it is not uncommon for some assistive technology users to purposely not upgrade their hardware and software. Think of how many times you’ve updated something and it broke a feature in some small, yet annoying way. Building off this feeling, it’s easy to understand why many people are so risk-adverse about their upgrade path, as it represents a very real fear of breaking an important tool they use to interact with the world.</p>\n<p>This is to say the presence of <a href=\"https://www.mozilla.org/en-US/firefox/organizations/\">an evergreen browser</a> may not mean it is fully up-to-date, or the presence of a popular operating system means it is running the latest and greatest version. In fact, a person may be taking deliberate measures to prevent a happy upgrade path from occurring.</p>\n<p>Fourth, <a href=\"https://www.smashingmagazine.com/2017/03/world-wide-web-not-wealthy-western-web-part-1/\">a huge swath of the world’s population</a> is geographically predisposed to using a low power device, just by accident of birth. Many emerging markets (and underserved communities) are coming online via <a href=\"https://qz.com/986042/google-goog-designed-android-go-to-win-over-the-next-billion-smartphone-users-in-the-developing-world/\">inexpensive Android smartphones</a>.</p>\n<p>These devices represent a person’s main form of access to the internet, and with Android comes the presence of <a href=\"https://play.google.com/store/apps/details?id=com.google.android.marvin.talkback&amp;hl=en_US\">the Android Accessibility Suite</a> (formerly known as <a href=\"https://9to5google.com/2018/06/20/google-talkback-android-accessibility-suite/\">TalkBack</a>). While the Suite is not nearly as robust or feature-rich as VoiceOver and Apple’s other accessibility settings, Android’s adoption numbers means you should be thinking about, and testing how your work deals with its limitations.</p>\n<h2 id=\"assistive-technology-may-be-augmented-by-other-assistive-technology\">Assistive technology may be augmented by other assistive technology</h2>\n<p>Multiple disability conditions can, and do affect people. Many of these conditions can be chronic, and their severity can compound as time goes on. Because of this, more than one assistive technology application or device, each with its own unique features and capabilities, may be used at any given moment.</p>\n<h2 id=\"the-presence-of-assistive-technology-isn%E2%80%99t-necessarily-permanent\">The presence of assistive technology isn’t necessarily permanent</h2>\n<p>Much as how more than one form of assistive technology may be swapped out for another on the fly, some people may only conditionally employ assistive technology in specific circumstances.</p>\n<p>An example of this would be someone using a magnifying glass or screen magnifier application in places where they can’t control text resizing.</p>\n<h2 id=\"a-person-who-could-benefit-from-assistive-technology-may-not-be-using-it\">A person who could benefit from assistive technology may not be using it</h2>\n<p>This touches on lack of resources and stigmatization issues discussed earlier.</p>\n<p>A couple of other reasons for non-adoption may be a person not feeling comfortable admitting to themselves that they need help, or that they are unaware that assistive technology offerings for their disability exist. The latter reason is further amplified the more specialized the technology is—there is a world of difference between adjusting text size and discovering and installing a <a href=\"https://addons.nvda-project.org/index.en.html\">NVDA add-on</a>.</p>\n<p>Another reason is a person simply not knowing that what they’re experiencing constitutes a disability condition. In the United States, and in many emerging markets, many barriers towards access and education are present.</p>\n<p>These are just a few of the many, many reasons why <a href=\"https://www.transportation.gov/briefing-room/dot7418\">we don’t make separate digital experiences</a> for disabled people anymore.</p>\n<h2 id=\"assistive-technology-may-not-be-considered-assistive-technology-by-the-person-using-it\">Assistive technology may not be considered assistive technology by the person using it</h2>\n<p>Think of the last time you struggled to tap a tiny button on your smartphone. Or when you were reading the subtitles on a muted video, so as to not disturb the other passengers on the train. Or when you boosted the brightness on your display. There are countless examples of this, where a person may be situationally disabled, but does not identify as such.</p>\n<p>This is important to think about for things like <a href=\"https://www.rockpapershotgun.com/2019/06/26/ubisofts-numbers-say-subtitles-are-really-jolly-popular/\">accessibility options in preference menus</a>, where someone may skip over features that could help them because they don’t consider themselves as being disabled.</p>\n<p>Configuring things to make them accessible by delving into preference menus, instead of leading with accessible defaults, also brings up the topic of less digitally-literate users. This brings us to our next point:</p>\n<h2 id=\"not-every-assistive-technology-user-is-a-power-user\">Not every assistive technology user is a power user</h2>\n<p>This is something that’s easy to forget when you work on a computer all day making things for other people to use on their computers.</p>\n<p>A digital device can be just one of many touch points that are required for a person to to their job or live their everyday life. Some people accept this as a matter-of-fact, but others may approach technology with a sense of dread.</p>\n<p>Every user is a new user at some point, and some never progress past the initial metaphors required to operate an interface at its most basic level (open and close, save and delete, etc.). It is not uncommon for these kinds of users to rigidly stay with what works (messaging friends and family, looking at photos, listening to music, watching movies, etc.), and never explore the other capabilities of their device.</p>\n<p>This is completely acceptable. User interfaces exist to make complicated code commands usable by the general population. This means that it’s our job to make sure our interfaces work for as many people as possible, as easily as possible. Being able to invest time and energy into understanding the borrowed metaphors utilized by a user interface, or series of user interfaces oftentimes stems from a position of privilege. In a business context, this unnecessary deciphering of intent also directly corresponds to lost opportunities.</p>\n<p>On top of all this, learning how to operate assistive technology can occur at a moment where someone is learning how to re-navigate many other important aspects of their life. This can translate to creating a very circumstantially steep learning curve.</p>\n<h2 id=\"not-every-assistive-technology-user-is-non-technical\">Not every assistive technology user is non-technical</h2>\n<p>This is an ugly, unfortunate myth that needs to die.</p>\n<h2 id=\"non-technical-people-may-make-highly-technical-modifications-to-their-technology\">Non-technical people may make highly technical modifications to their technology</h2>\n<p>People are creative, resourceful, and persistent, especially when the motivating factors are high. To think anything less is a disservice. People also rely on other people. In the disabled community, this is known as <a href=\"https://thebodyisnotanapology.com/magazine/independence-is-an-ableist-myth-unlocking-the-power-of-community-in-healing/\">the myth of independence</a>.</p>\n<p>Think of how many times a friend or family member has asked you to fix their computer for them, because you possessed a skill they needed. Then think of the times you asked them to provide aid with something you didn’t know how to do.</p>\n<p>Is it so much of a stretch to imagine that a motivated individual can research and install a browser extension? Or that a technical person can create or configure a specialized software or hardware solution for someone they care about? No, of course not.</p>\n<p>For those people who self-serve, it’s also important to remember that there are levels of technical complexity, many of them unnecessarily artificial. Chances are good that someone can learn to tweak <code>.u-color-black</code> to be green without knowing what a <a href=\"https://adamwathan.me/css-utility-classes-and-separation-of-concerns/\">utility class namespace</a> is. Compare this to reverse-engineering a declaration like <code translate=\"no\">.css-1dbjc4n.r-1awozwy.r-1iusvr4.r-16y2uox.r-1wtj0ep.r-pu8h1j.r-jzbu7t.r-bcqeeo.r-bnwqim</code>.</p>\n<p>Does this mean abandoning modern frameworks and development tools entirely? No. Just remember that what they output, and how they output it is potentially another user-facing interface.</p>\n<h2 id=\"aria-has-varying-levels-of-support\">ARIA has varying levels of support</h2>\n<p>While there are a finite (if large) amount of user agents and assistive technologies, the possible permutations of web content implementations is near-infinite. Because of this, <a href=\"https://www.w3.org/WAI/standards-guidelines/aria/\">Accessible Rich Internet Applications (<abbr>ARIA</abbr>)</a> was created. Its purpose is to address potential unanticipated gaps between a content implementation pattern and assistive technology.</p>\n<p>As it is a relatively new and niche technology, ARIA has <a href=\"https://caniuse.com/#feat=wai-aria\">varying levels of support</a>. This is further complicated by the fact that support is dependent on <a href=\"https://www.smashingmagazine.com/2018/09/importance-manual-accessibility-testing/#windows\">the combination of operating system, assistive technology, and browser</a> being used.</p>\n<p>A lack of support may mean a couple of things: First, assistive technology may simply not report anything. Second, and more worryingly, it may mean assistive technology reports, but reports inaccurately.</p>\n<p>ARIA support fragments further if it includes combinations of multiple ARIA declarations, both on the same DOM node, and working in coordination on a more complicated multi-node component. Support concerns compound even more if these multiple multi-node components communicate with each other.</p>\n<p>Automated accessibility checking software may not catch these support issues, as the authored code may be technically correct from an implementation perspective, but unusable from a human perspective.</p>\n<p>This is no different than writing HTML, JavaScript, or CSS that passes CI/CD checks, but is not supported on the browser level.</p>\n<p>This is also to say nothing of <a href=\"https://en.m.wikipedia.org/wiki/PlayStation_Portable#Web_browser\">niche browsers</a>, browsing modes, bugs and regressions, and software rot. The devil is in the details here.</p>\n<h2 id=\"aria-increases-the-time-it-takes-to-calculate-an-accessible-name\">ARIA increases the time it takes to calculate an accessible name</h2>\n<p>An <a href=\"https://developer.paciellogroup.com/blog/2017/04/what-is-an-accessible-name/\">accessible name</a> is the phrase assistive technology will report to the person using it, and is a core aspect of how assistive technology functions.</p>\n<p>For example, a link may have an accessible name of “The history of whiskey”, which is provided by the words written in between the opening and closing anchor element tags (<code translate=\"no\">&lt;a href=&quot;whiskey-history.html&quot;&gt;The history of whiskey&lt;/a&gt;</code>). The anchor element provides <a href=\"https://www.w3.org/WAI/PF/aria/roles\">a Role</a>, which communicates expectations around behavior. Combined, they inform the person using assistive technology that this is a link that takes them to a page where they can learn more about the history of whiskey.</p>\n<p>The anchor element, like <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element\">every other HTML element</a>, comes with what is known as <em>native semantics</em>. Native semantics are roles that are inherent to the element being used. You don’t have to make an additional, redundant ARIA Role declaration on something described semantically. It is something you get for free by virtue of using the proper element and <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Attributes\">attribute</a>.</p>\n<p>The <code translate=\"no\">button</code> element, for example, is a clear, unambiguous signifier of intent to both authors and browsers. It also enjoys <a href=\"https://www.w3.org/TR/html4/\">wide and deep support</a>, even for non-traditional or atypical devices that may possess rudimentary browsing capabilities.</p>\n<p>When ARIA is used to recreate the native semantics inherent in HTML, it increases the work the Accessibility Tree needs to do to figure out what the ARIA is trying to describe, including its accessible name and permitted (and therefore expected) behavior.</p>\n<p>Small amounts of ARIA, skillfully applied to address the occasional gap, makes for a small amount of processing work a browser sends to the Accessibility Tree. Larger amounts of ARIA, especially when not augmenting a native semantic HTML element—and especially when being used to construct multiple, complicated interactive user interface components—translates to an large amount of processing work that an Accessibility Tree’s heuristics needs to do to create meaningful reporting.</p>\n<p>There is a reason <a href=\"https://www.w3.org/TR/using-aria/#firstrule\">the First Rule of ARIA</a> prioritizes using appropriate native HTML elements whenever possible. Too much ARIA can create a slowdown and/or lack of synchronization between the current state of a website or web app, and what is being reported by assistive technology—especially lower power versions of it. In some extreme cases, it can even overwhelm the Accessibility Tree and crash it. It’s worth stating directly that both of these scenarios create an unacceptable user experience.</p>\n<p>A concerning recent trend is <a href=\"https://css-tricks.com/aria-spackle-not-rebar/\">the over-application of ARIA</a>. It’s a phenomenon that seems to especially present in modern JavaScript-intensive websites and web apps. <a href=\"https://medium.com/@francesco_rizzi/javascript-main-thread-dissected-43c85fce7e23\">JavaScript blocks the main thread</a>, which delays other processing tasks from occurring. This compounds the aforementioned slowdown/crashing issue, especially for browsers that need to <a href=\"https://twitter.com/MarcoInEnglish/status/1089412779625402368\">send this information across a process boundary</a> (this processing delay issue also affects <a href=\"https://twitter.com/aburone/status/1153483023884738560\">people in non-assistive technology contexts</a>, as well).</p>\n<p>There are many good reasons to built performant websites and web apps. Slowing down or crashing the Accessibility Tree is another, vital reason, one that is unfortunately not commonly known.</p>\n<h2 id=\"windows-high-contrast-mode-ignores-aria\">Windows High Contrast Mode ignores ARIA</h2>\n<p><a href=\"https://support.microsoft.com/en-us/help/13862/windows-use-high-contrast-mode\">Windows High Contrast Mode</a> is a specialized assistive technology solution that affects the entire Windows operating system, including all browser content. It strips away styling, <a href=\"https://twitter.com/HugoGiraudel/status/877123359418576896\">prioritizing making text content legible</a> above all else. This is by design.</p>\n<p>For people experiencing low vision, High Contrast Mode can be their last, best hope for viewing digital content. While I am loathe to speak about accessibility support in terms of numbers, some quick, back-of-the-envelope math tells us that assuming if even 1% of <a href=\"https://www.zdnet.com/article/microsoft-says-windows-10-is-now-on-more-than-800-million-devices/\">the 800 million devices using Windows 10</a> also use High Contrast Mode, it means that there are 80,000 users (to compare, my hometown has a population of ~25,000). This is to say nothing of still-active versions of Windows 8 and 7.</p>\n<p>I should also point out that there is no minimum acceptable threshold of support, and that it is an awful way to think about the problem. If you can’t empathize with such a large figure, can’t make the connection that the figure might contain you care about, or can’t understand that it may also be <a href=\"https://uxmag.com/articles/we-re-just-temporarily-abled\">a future version of yourself</a>, understand that <a href=\"https://www.w3.org/WAI/policies/\">inaccessible websites are illegal</a>.</p>\n<p>In Windows High Contrast Mode, an element’s native semantics affects how it appears. For example, an anchor element will get a different visual treatment than paragraph text or list items. Anchors created from non-semantic elements such as <code translate=\"no\">span</code>s or <code translate=\"no\">div</code>s that rely on ARIA to create link functionality won’t get this visual treatment. The same goes for any and all interactive user interface components built from non-semantic elements.</p>\n<p>This means that unless an interactive component uses incredibly obvious language for its functionality, there is a large chance that it won’t be perceived as something can be interacted with—even more so in the presence of a <a href=\"https://www.technica11y.org/designing-and-coding-for-low-vision\">lower screen resolution and/or screen magnification scenario</a>, where only a portion of the component may be visible. This means that <a href=\"https://www.w3.org/TR/WCAG21/#perceivable\">it is inaccessible</a>.</p>\n<p>Once again, the First Rule of ARIA applies. By relying on well-supported, time-tested markup to describe our content, we are able to make our work versatile and robust. This is for not only current modes of operation we may not be familiar with, but also future technologies that have yet to be invented.</p>\n<h2 id=\"a-disabled-person-may-not-be-present-in-the-communication-channels-you-use\">A disabled person may not be present in the communication channels you use</h2>\n<p>There are many reasons you may not be aware of inaccessibility issues, but the main one is systemic structural inequality.</p>\n<p>As the practice of digital accessibility becomes more mainstream, we’re discovering that <a href=\"https://www.gatsbyjs.org/blog/2019-07-11-user-testing-accessible-client-routing/\">many things we took for granted may in fact not be true</a>. The tools we use, by their very nature, may prohibit someone from operating the mechanisms required to <a href=\"https://a11y.reviews/#typeform\">make you aware of the issues preventing someone from being present</a>.</p>\n<p>This does not mean that their lived experiences are invalid.</p>\n<p>Just because someone is disabled doesn’t mean that they must devote their life to reporting or fixing these errors, either. It’s a huge, unfair ask. The responsibility should be on you, the digital technology maker, to do this. It is a code quality issue, another thing to be on the lookout for alongside concerns such as bugs, unoptimized code, regressions, and memory leaks.</p>\n<h2 id=\"your-ego-may-be-the-biggest-barrier\">Your ego may be the biggest barrier</h2>\n<p>Perhaps the most difficult thing is internalizing all of this. Digital accessibility work is not easy, but it is vital. It is a holistic, multifaceted discipline that touches on multiple interconnected social and technological issues.</p>\n<p>Hopefully, this isn’t discouraging. Everyone makes mistakes, and I’m certainly not exempt from making them. Fortunately, digital technology—and especially the web—allows us to make good on our errors and missteps quickly and with minimal cost.</p>\n<p>A question I constantly ask myself is if it’s worth being perceived as being correct at the expense of not meeting the needs of those who I am trying to help. Part of that means being willing to listen, and having the humility to make improvements on what I say and make, even if it requires internalizing an uncomfortable truth.</p>\n",
      "date_published": "2019-07-28T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Attempting to corral colors with a Sass function",
      "content_html": "",
      "date_published": "2019-06-06T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "ARIA is Spackle, Not Rebar",
      "content_html": "",
      "date_published": "2019-05-19T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Universal Design: 11 Practical Tips to Make Your Sites and Apps More Accessible",
      "content_html": "",
      "date_published": "2019-05-14T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/writing/lighthouse/",
      "url": "https://ericwbailey.design/writing/lighthouse/",
      "title": "Lighthouse",
      "content_html": "<p><a href=\"https://developers.google.com/web/tools/lighthouse/\">Lighthouse</a> is an open source auditing tool made by Google to help developers understand how well their site is doing in terms of four metrics: <a href=\"https://developers.google.com/web/tools/lighthouse/audits/critical-request-chains\">Performance</a>, <a href=\"https://developers.google.com/web/tools/lighthouse/audits/appcache\">Best Practices</a>, <a href=\"https://developers.google.com/web/tools/lighthouse/audits/description\">Search Engine Optimization (<abbr>SEO</abbr>)</a>, and <a href=\"https://developers.google.com/web/tools/lighthouse/audits/button-name\">Accessibility</a>. If you’re feeling adventurous, it will also measure your progress as a <a href=\"https://developers.google.com/web/tools/lighthouse/audits/address-bar\">Progressive Web App (<abbr>PWA</abbr>)</a>.</p>\n<p>These metrics are what Google uses to determine if you have a quality website or web app. Their codification means that we now have a relatively transparent ruleset we can compare our work against, instead of just making guesses and hoping their search ranking process likes it.</p>\n<p>Search ranking is the name of the game. Google is, for better or worse, how most of us search for anything on the web now. Much like club bouncers, making ourselves look good for Google means there’s a better chance we get placed at the front of the line. And being at the front of the line is important—many businesses’ success lives or dies by it.</p>\n<p>As far as metrics go, I think they’re great ones. The code it checks for covers a wide range of concerns, all of which compound to make your website or web app a far better experience from many different perspectives. I also think it’s a clever move on their part to quantify it visually. Getting those pie charts to display 100 is definitely an effective carrot for a lot of developers I know. Heck, <a href=\"https://lighthouse-dot-webdotdevsite.appspot.com/lh/html?url=https://ericwbailey.design/#accessibility\">it worked on me</a>.</p>\n<p><img\n  alt=\"Lighthouse results for ericwbailey.design. There are four pie charts, each containing a ranking score. Performance has a rank of 100, accessibility has a rank of 98, best practices has a rank of 100, and SEO has a rank of 99. A legend is present, showing a score of 0-49 corresponding to red, 50-89 corresponding to yellow, and 90-100 corresponding to green.\"\n  src=\"/img/posts/lighthouse/lighthouse.png\" /></p>\n<h2 id=\"moving-the-needle\">Moving the needle</h2>\n<p>Google will make adjustments to its search ranking process based on what it perceives as best for the people who use it. This behavior isn’t altruistic. It is a premeditated and calculated act to maximize its value as a product—people don’t have much of an incentive to use Google if the results it generates are poor.</p>\n<p>Sometimes these adjustments are dramatic. In 2015, they introduced “<a href=\"https://twitter.com/search?q=%23mobilegeddon&amp;src=typd\">#mobilegeddon</a>,” a metric that <a href=\"https://searchengineland.com/library/google/google-mobile-friendly-update\">penalizes non-responsive websites and web apps</a>. It was a sensational update, but also a much-needed one, as it provided a huge incentive for companies to meet their customers where they were: <a href=\"http://gs.statcounter.com/platform-market-share/desktop-mobile-tablet#monthly-201001-201901\">on their mobile devices</a>.</p>\n<p>Another notable update was their <a href=\"https://webmasters.googleblog.com/2018/01/using-page-speed-in-mobile-search.html\">2018 Page Speed update</a>, which penalizes the slowest, worst-performing websites. Again, this makes sense: if something is too big to load, takes too long to load, and/or costs you a fortune to load, there’s not a lot of incentive to visit it. A page that never loads can’t serve up ads, either.</p>\n<h2 id=\"making-lighthouse-happy-makes-google-happy%2C-to-a-point\">Making Lighthouse happy makes Google happy, to a point</h2>\n<p>To the best of my knowledge, Google currently does not factor Lighthouse accessibility scores into how it determines search ranking. Unlike being non-responsive or non-performant, you’re not dinged for having an inaccessible site.</p>\n<p>This is as curious as it is infuriating. The mechanisms that Google uses to comb through and rank website and web app content are analogous to how assistive technologies function. Wouldn’t they want to make this process easier for themselves? At the scale that Google operates at, faster and more accurate page scraping could translate to a great deal of money saved on computational power.</p>\n<h2 id=\"switch-it-on\">Switch it on</h2>\n<p>Here’s a thought: what if Google put its thumb on the scale again, only this time for accessibility? What if it treated the Lighthouse accessibility score as a first-class ranking metric?</p>\n<p>Before we get too far down this path, I’d like to say this idea isn’t new, nor am I its originator. However, it does not mean the idea not worth discussing.</p>\n<p>I’d also like to leave aside related points about Google’s monopoly on information access, it’s influence on the development of web technologies, as well as its push to popularize AMP in place of existing standards. They’re all things I’m aware of and concerned about, but beyond the scope of this post.</p>\n<p>I am also aware that <a href=\"https://www.deque.com/axe/\">Deque’s axe API</a> powers Lighthouse under the hood, why <a href=\"https://www.smashingmagazine.com/2018/09/importance-manual-accessibility-testing/\">automated accessibility tests are only part of the picture</a> when it comes to ensuring your site is accessible, and why <a href=\"https://www.scottohara.me/blog/2019/03/26/a-warning-about-warnings.html\">a numerical score can be a fallacy</a> in terms of <a href=\"https://twitter.com/bamadesigner/status/1124822513660375040\">guaranteeing actual usability</a>.</p>\n<h2 id=\"the-great-de-rankening\">The great de-rankening</h2>\n<p>We already know that nearly every major site on the internet is <a href=\"https://webaim.org/projects/million/\">an inaccessible shitpile</a>. Even if Google only penalized critical accessibility issues, there’d still be a drastic drop across the board. It’s such a pervasive problem that <a href=\"https://lighthouse-dot-webdotdevsite.appspot.com/lh/html?url=https://android-developers.googleblog.com/2019/05/whats-new-in-play.html#accessibility\">even Google’s own content would be affected</a>.</p>\n<p>This mass de-ranking would create fast and furious competition to regain lost standing—an event not without historical precedent.</p>\n<h3 id=\"google-panda\">Google Panda</h3>\n<p>In 2011, Google began to make changes to the algorithms it uses to rank websites, to reward what it considered high-quality websites and punish the opposite. The update was known as <a href=\"https://moz.com/learn/seo/google-panda\">Google Panda</a>.</p>\n<p>Google Panda specifically targeted a lot of unsavory SEO techniques, including content farms, “thin” content pages, low-quality affiliate linking schemes, and search query baiting. For those who made their living by gaming the system to serve up spam, it was disastrous. For those who just wanted to find what they were looking for online with minimal hassle, it was a huge win.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"Source: What is Google Panda? How Content Matters in SEO by Riverbed Marketing.\">\n  <img\n    alt=\"A graph showing how search engine traffic drastically dropped in early January 2011 from just under 7.5 million to under a million in just a few weeks. Ads traffic is a steady zero throughout the entire graph. A tooltip is highlighting September 2014, showing search engine traffic of 14,485, and ads traffic of 0.\"\n    src=\"/img/posts/2019-05-14-lighthouse/google-panda-graph.png\" />\n  <figcaption>\n    <span class=\"typography-small-caps\">Source:</span> <a href=\"https://www.riverbedmarketing.com/what-is-google-panda/\">What is Google Panda? How Content Matters in SEO</a> by Riverbed Marketing.\n  </figcaption>\n</figure>\n<h3 id=\"blood-in-the-water\">Blood in the water</h3>\n<p>Much like with Google Panda, there would be an inevitable scramble of activity to recover from the ranking hit for having an inaccessible site. With that scramble come the hucksters and the snake oil.</p>\n<p>Accessibility work is difficult, accessibility remediation even more so. It’s easy to envision the rise of a cottage industry of people who promise quick-fix solutions to years of poor quality code. In fact, it’s something we’re already starting to see.</p>\n<h4 id=\"plugins-and-overlays\">Plugins and overlays</h4>\n<p>Accessibility overlays are snippets of third party code you add to your website or web app. In exchange for some money, the service that maintains this code will generate a little modal window containing features intended to assist people with understanding and operating things. Much like a bandage left on for too long, this kind of solution inhibits growth and eventually causes what it covers to rot.</p>\n<p>Because of their <a href=\"https://karlgroves.com/2012/04/19/can-assistive-technology-make-a-website-accessible\">many, highly problematic issues</a>, I won’t directly link to, or name any of the accessibility overlay products out there. However, I will stress my main concern: the simple fact <a href=\"https://blog.tenon.io/web-accessibility-overlays-dont-work\">that they <em>don’t work</em></a>.</p>\n<p>The predatory exploitation of this space is disgusting. And, like any other third party script you add to your site, it’s code you can’t control. With that comes a gamble against issues surrounding trust, such as an (ironically inaccessible) text-to-speech plugin getting <a href=\"https://en.m.wikipedia.org/wiki/BrowseAloud#Controversies\">silently converted into a bitcoin miner</a>.</p>\n<p>I’d also be remiss if I didn’t mention how third party code can call in other third party code, including things like analytics and CRM tools. This capability is incredibly problematic with regards to disability, especially if it isn’t clear <a href=\"https://css-tricks.com/accessibility-events/\">who has access to this information or what they’re doing with it</a>.</p>\n<h4 id=\"lawyers\">Lawyers</h4>\n<p>There is now also <a href=\"https://www.forbes.com/sites/legalnewsline/2017/06/13/first-of-its-kind-trial-goes-plaintiffs-way-winn-dixie-must-update-website-for-the-blind/\">legal precedent</a> for individuals being able to sue private companies for having inaccessible websites (and rightly so). With that has come <a href=\"https://www.adatitleiii.com/2019/01/number-of-federal-website-accessibility-lawsuits-nearly-triple-exceeding-2250-in-2018/\">a rash of lawsuits</a> created by ambulance-chasing lawyers, many who don’t have representation from an actual affected plaintiff.</p>\n<p>Automated code checkers such as Lighthouse are a bit of a double-edged sword in this situation, in that you can just grab a list of the top one thousand websites, feed it to this sort of tool and have a list of potential targets ready to go in just a few minutes’ time.</p>\n<p>My view here is the damage has already been done. These drive-by lawsuits create a bad impression of accessibility work to an industry that already has a dim view of it—better to scale it to the point where everyone is forced to put in at least nominal good faith efforts. Better yet, <a href=\"https://medium.com/confrere/its-illegal-to-have-an-inaccessible-website-in-norway-and-that-s-good-news-for-all-of-us-b59a9e929d54\">codify it into law</a> and do away with the problem entirely.</p>\n<h2 id=\"market-forces\">Market forces</h2>\n<p>With the short-term problems acknowledged, I still think a mass de-ranking would make things better in the long run. For example, it’s easy to foresee a lot of effort finally getting directed into one of the areas where it’s needed most: code frameworks.</p>\n<p>It would force these kinds of libraries to deliver on what they promise: quality code. After all, isn’t that why they exist? To lessen the amount of work it takes to make something, with the understanding that it’s built using community best practices?</p>\n<h3 id=\"you-mustn't-be-afraid-to-dream-a-little-bigger%2C-darling\">You mustn't be afraid to dream a little bigger, darling</h3>\n<p><a href=\"https://wptavern.com/wpcampus-gutenberg-accessibility-audit-finds-significant-and-pervasive-accessibility-problems\">Gutenberg is inevitable</a>. <a href=\"https://reach.tech/router/accessibility\">Third party plugins</a> need to be bolted onto React to provide even a semblance of assistive technology-friendly navigation. Hang out on enough issue trackers, and you'll see a pattern of <a href=\"https://bugs.chromium.org/p/chromium/issues/detail?id=90172\">accessibility-related issues getting downplayed</a>, deprioritized, and berated.</p>\n<p>Frameworks are also here to stay—we’ll never get developers to stop reaching for them. To square this circle, maybe we force everyone’s hands and turn digital accessibility into the unavoidable, non-negotiable cost-of-entry consideration it should have always been.</p>\n<p><a href=\"https://www.mattcutts.com/\">Matt Cutts</a>, Google's head of Webspam at the time of the Panda update, <a href=\"https://en.m.wikipedia.org/wiki/Google_Panda\">commented that</a> “…with Panda, Google took a big enough revenue hit via some partners that Google actually needed to disclose Panda as a material impact on an earnings call. But I believe it was the right decision to launch Panda, both for the long-term trust of our users and for a better ecosystem for publishers.”</p>\n<p>A better ecosystem is what I’m after. If that means having to petition the king, so be it.</p>\n",
      "date_published": "2019-05-13T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/writing/fighting-uphill/",
      "url": "https://ericwbailey.design/writing/fighting-uphill/",
      "title": "Fighting uphill",
      "content_html": "<p>As someone with a good deal of interest in the digital accessibility space, I follow <a href=\"https://webaim.org/\">WebAIM</a>’s work closely. Their survey results are priceless <a href=\"https://webaim.org/projects/screenreadersurvey7/\">insights into how disabled people actually use the web</a>, so when the organization speaks with authority on a subject, I listen.</p>\n<p>WebAIM’s <a href=\"https://webaim.org/projects/million/\">accessibility analysis of the top 1,000,000 homepages</a> was <a href=\"https://twitter.com/webaim/status/1100844774163009536\">released to the public on February 27, 2019</a>. I’ve had a few days to process it, and frankly, it’s left me feeling pretty depressed. In a sea of already demoralizing findings, probably the most notable one is that pages containing <a href=\"https://www.w3.org/WAI/standards-guidelines/aria/\"><abbr>ARIA<abbr></a>—a specialized language intended to aid accessibility—are actually <em>more</em> likely to have accessibility issues.</p>\n<p>I don't think this is intentional malice on the part of authors, but it is worth saying that <a href=\"https://css-tricks.com/aria-spackle-not-rebar/\">the road to hell is paved with good intentions</a>. These failures via omission and ignorance actively <a href=\"https://marcysutton.com/accessibility-is-a-civil-right\">separate people from their civil rights</a>.</p>\n<p>I view the issue largely as an education problem, and that education is tied into what the market demands.</p>\n<p>Although the <a href=\"https://twitter.com/A11YProject/status/1100855699884642309\">replies to this Twitter thread</a> are heartwarming, I realistically understand that accessibility knowledge isn’t what employers are largely demanding. Because of this, people entering into the web design and development space <a href=\"http://adrianroselli.com/2018/07/demand-refunds-for-invalid-html-in-courses.html\">simply may not be aware of accessibility as a technical concern</a>.</p>\n<p>Overwhelmingly, crushingly, we shove new developers towards learning JavaScript single page application frameworks (SPAs). While many of these frameworks pay lip service towards preserving accessibility, if you do your homework you find that the majority of them were built without assistive technology in mind. These considerations were bolted on later, when their creators figured out that the things they threw away to get a more app-like experience actually mattered.</p>\n<p>My go-to examples are routing and focus management. It’s a sad, sorry state of affairs that this critical functionality oftentimes requires third party plugins to make them capable of interfacing with assistive technology. The decision to use <abbr>SPA</abbr>s, and all that come with them, can often come from <a href=\"https://whatisjasongoldstein.com/writing/help-none-of-my-projects-want-to-be-spas/\">baseless nerd navelgazing</a>—many business owners would be livid to find out that the technology choices their teams are making are actively incurring legal liability.</p>\n<h2 id=\"punching-down\">Punching down</h2>\n<p>It’s too easy and too irresponsible to lay blame solely on new developers. Turning again to the WebAIM survey, we know that <a href=\"https://webaim.org/projects/million/#labels\">over 50% of all form inputs are not labeled</a>. This is basic stuff, things that people who have been working in the industry for any significant length of time should know. How can we expect the advanced, state-driven stuff to be built robustly if we’re all failing HTML 101</p>\n<h2 id=\"what-if-we%E2%80%99re-losing%3F\">What if we’re losing?</h2>\n<p>It’s a tough question, but one I think is worth asking.</p>\n<p>In some respects, practicing web accessibility has never been better. <a href=\"https://developer.mozilla.org/en-US/docs/Tools/Accessibility_inspector\">Firefox has an accessibility inspector</a> now, which is straight-up amazing. We have near-magical developer tools (plural!), dedicated conferences, <a href=\"https://a11yrules.com/\">podcasts</a>, meetups, and highly paid people in influential positions making grandiose declarations about the importance of empathy.</p>\n<p>And yet, WebAIM’s report. All these incremental improvements aren’t compounding at an equal or greater pace than the things they’re trying to combat.</p>\n<p>It’s code and design issues stemming from a market demand problem, yes. But I also think it’s a process problem. Namely, we can’t shovel all our blame on the developers—classically the go-to scapegoats for organizational failure.</p>\n<p>We’re <em>all</em> to blame for the state of things—I'm no exception. A lack of understanding and wholesale adoption of antipatterns are also at fault. Just because a big name company does something doesn’t mean it's <a href=\"https://www.24a11y.com/2018/i-threw-away-my-mouse/\">intrinsically good</a>.</p>\n<h2 id=\"technology-solutions-to-social-problems\">Technology solutions to social problems</h2>\n<p>If we can’t get the majority of web practitioners to care about, much less implement accessible websites, what can be done? Browsers already describe websites the best way they know how, via the Document Object Model (DOM). <a href=\"https://alistapart.com/article/semantics-to-screen-readers\">Assistive technologies describe what the <abbr>DOM</abbr> contains</a> the best they can, even utilizing specialized heuristics to accommodate code that isn’t quite good enough.</p>\n<p>But &quot;isn’t quite good enough” isn’t the same as outright bad—these specialized programs can only do so much.</p>\n<h3 id=\"seeing-machines\">Seeing machines</h3>\n<p>I’ve been paying attention to <a href=\"https://www.androidpolice.com/2018/03/12/mozilla-working-page-popup-blocker-firefox/\">Mozilla’s efforts to create an interstitial popup blocker</a>. For those unfamiliar with interstitials, they’re the annoying (often inaccessible) on-page modals that commonly ask you to do things like sign up for newsletters.</p>\n<p>The trick here is these interstitial are different from traditional popups in that you can’t just block anything that spawns from the page you’re currently visiting. They’re a little more tricky, in that it's just another “layer” of the website you’re visiting, and therefore can’t be clipped away with tidy logic.</p>\n<p>Mozilla’s approach is to <a href=\"https://twitter.com/ehsanakhgari/status/972224912634064896\">ask for examples of interstitials</a> people find on the web, and then use that corpus of information to train a machine learning algorithm to understand what an interstitial popup “looks” like. Armed with that knowledge, it can then strip away the code of anything that qualifies as interstitial-ish.</p>\n<p>It’s a fiendishly clever idea, and probably one of the few applications of machine learning I’ve encountered that actually has merit. It also got me wondering: if we can’t change how assistive technology generates descriptions of the <abbr>DOM</abbr>, can we change how it views websites instead?</p>\n<p>If we can teach a computer to identify what all the various bits that make up a website look like, maybe we can attack the problem of inaccessible experiences from a slightly different direction. Once the computer “views” a page and reports on what it sees, it can then read out the text contained in those identified areas. Screen readers sort of already do this, and even have specialized functionality for <a href=\"https://doccenter.freedomscientific.com/doccenter/doccenter/rs25c51746a0cc/2014-09-24_enhancedconvenientocrandsemi-autoformsmode/02_ConvenientOCR.htm\">when the text isn’t actually text</a>.</p>\n<p>We’re starting to see hints of this kind of thinking already. Examples that come to mind are <a href=\"https://codepen.io/sdras/details/jawPGa\">Sarah Drasner’s brilliant CodePen</a> that uses Azure's Computer Vision <abbr>API</abbr> to automatically generate alt descriptions for images. <a href=\"https://airbnb.design/sketching-interfaces/\">Airbnb’s sketching interfaces</a> project is also a tiny, powerful glimpse into this sort of future.</p>\n<h3 id=\"however\">However</h3>\n<p>It’s really easy to say someone should do something, but it’s far more difficult to actually do it. Debating the merits of hypotheticals only takes you so far.</p>\n<p>I’m not naïve enough to think this sort of idea would require a non-trivial amount of engineering to create. The field of digital accessibility is small and commonly viewed as unglamorous work, so I’m not holding my breath for venture capital firms to line up for the chance to give me funding for this half-baked concept.</p>\n<p>There’s also the uncomfortable truth that this sort of automation is only as good as the data it’s trained on, and the field of machine learning is <a href=\"https://www.vox.com/future-perfect/2019/3/5/18251924/self-driving-car-racial-bias-study-autonomous-vehicle-dark-skin\">rife with algorithmic bias</a>. When you start to use data at scale to make decisions, you also perpetuate the biases inherent in that data.</p>\n<p>Furthermore, when you rely on this approach to navigate the web, you start to get into a very uncomfortable problem in delivering equivalent experiences; namely editorializing the experience for someone instead of presenting it to them the way someone who wasn’t relying on that technology would.</p>\n<p>A practical example of this is automatically generated alt descriptions. If a system is built to reject certain kinds of information—say nudity—it won’t generate the information a person who doesn’t rely on the description will be privy to. It also may not be the nudity the system thinks it is.</p>\n<p>A classical Greek statue meets all the criteria for a naked person, yet it is not. There have been, however, situations where it is flagged as pornography and a description is not generated. If you need an example of how this sort of thing falls apart at scale, just <a href=\"https://gizmodo.com/tumblrs-porn-filter-flags-its-own-examples-of-permitted-1831151178\">look at tumblr</a>.</p>\n<p>Another way of saying it: implicitly defining the parameters of what is acceptable for expression via automation can have the effect of reducing individual autonomy. This is unconscionable.</p>\n<p>Finally, not every disabled user is a screen reader user. The machine learning approach doesn’t work for many different kinds of disability situations, notably <a href=\"https://webaim.org/articles/cognitive/\">cognitive concerns</a>.</p>\n<h2 id=\"social-solutions-to-technology-problems\">Social solutions to technology problems</h2>\n<p>I’m a big nerd, so of course I led with an idea for software. But all too often we conflate creating <em>something</em> with creating <em>good</em>.</p>\n<p>As touched on earlier, it seems like the pace of inaccessible digital experiences is moving far faster than our attempts to fix them. I’m skeptical of technology’s ability to solve the problem on its own.</p>\n<p>It’s also far more easy to destroy than it is to repair. If you don’t believe me, spend some time conducting a manual website accessibility audit. It oftentimes feels like a tedious, frustrating, thankless experience that firmly paints you as the enemy for people who just want to move fast and break things. However, it is a very vital thing to do.</p>\n<p>So, what can we do about this state of affairs?</p>\n<h3 id=\"learn-from-history\">Learn from history</h3>\n<p>Digital accessibility is a niche practice. That’s not a value judgement, it’s just the way things are. Again, it’s hard to fault someone for creating an inaccessible experience if they simply haven’t learned the concept exists.</p>\n<p>And yet, <a href=\"https://www.huffingtonpost.co.uk/damiano-la-rocca/website-accessibility_b_9931304.html\">seventy percent of websites are non-compliant</a>. It’s a shocking statistic. What if I told you that seventy percent of all bridges were structurally unsound?</p>\n<p>Some engineers who work with physical materials have a constant reminder of the gravity of the decisions they make. They <a href=\"https://blogs.scientificamerican.com/oscillator/ring-ritual-reminds-engineers-of-their-responsibility/\">wear iron rings</a> to be reminded that they have an obligation to the public good, and that actual lives are on the line. I like that idea a lot—I think it's a concept we as an industry could benefit from if we borrowed from it thematically.</p>\n<p>It’d take some organizing to get to a place where we do such a thing. And maybe that’s a good thing—right now it feels like we’re an industry of <a href=\"https://twitter.com/ericwbailey/status/1082694786480513026\">overpaid, fly-by-night plumbers</a> who have the luxury of saying they don’t believe in using wrenches.</p>\n<h3 id=\"directed-effort\">Directed effort</h3>\n<p>It was a bitter, frustrating, oftentimes thankless task, but we should also acknowledge that <a href=\"https://www.webstandards.org/2013/03/01/our-work-here-is-done/index.html\">web standards <em>won</em></a>. It took a ton of time and effort to get to this point, but think about what didn’t make it: closed, centralized, brittle technologies that were pay-to-play and difficult to understand and maintain.</p>\n<p>We should also think about what technologies are available to us today, how they serve the people that use them, and how so much of it is built from these standards. While it may feel frustrating doing the work now, maybe that inflection point is just beyond the horizon.</p>\n<h3 id=\"reframing\">Reframing</h3>\n<p>Selfishly, I’d love a future where it's commonplace for interview candidates to be selected not only because of their JavaScript prowess, but also because they can offer <a href=\"https://scottaohara.github.io/accessibility_interview_questions/\">a sound explanation</a> of why using a <code>button</code> element is important.</p>\n<p>I’m really excited to see digital accessibility get more mainstream attention, but I’m also concerned. I don’t want it to have fifteen minutes of fame. I want it to be a first class, top-of-mind consideration for everyone in the industry.</p>\n<p>I really admire the people who are using their privilege as an influential industry member to push for this reality. <a href=\"https://twitter.com/beep\">Ethan Marcotte</a> and <a href=\"https://twitter.com/SaraSoueidan\">Sara Soueidan</a> come immediately to mind—they are doing an amazing job lending credibility to the practice as they learn more about the space. This is also not to diminish their other efforts, which have done so much to drive the web forward.</p>\n<p>It’s been great seeing more and more accessibility talks appearing on the conference circuit, as well. The subject matter hasn’t historically gotten a lot of mainstream stage presence. This meant that there have been less opportunities for people to discover digital accessibility was even was a concern, much less be positioned as a glamorous subject that was worth spending a few thousand dollars on a ticket to hear someone talk about.</p>\n<p>I also think the push to diversify our industry voices has helped bring accessibility concerns to the forefront, as well as other important topics. And speaking of diversification, I’d be remiss if I didn’t mention <a href=\"https://twitter.com/katholmes\">Kat Holmes</a>’ work on Inclusive Design. If you want to read a brilliant treatise on reframing, read <a href=\"https://mitpress.mit.edu/books/mismatch\"><cite>Mismatch</cite></a>.</p>\n<h2 id=\"acknowledgment\">Acknowledgment</h2>\n<p>I also think it’s worth acknowledging that we’re all standing on the shoulders of giants. New voices (such as myself), are speaking about what we’ve learned largely due to the fact that there’s been existing material to learn from. People like <a href=\"https://twitter.com/LeonieWatson\">Léonie Watson</a>, <a href=\"https://twitter.com/MarcoInEnglish\">Marco Zehe</a>, <a href=\"https://twitter.com/stevefaulkner\">Steve Faulkner</a>, <a href=\"https://twitter.com/goodwitch\">Glenda Sims</a>, <a href=\"https://twitter.com/thebillygregory\">Billy Gregory</a>, <a href=\"https://twitter.com/LFLegal\">Lainey Feingold</a>, <a href=\"https://twitter.com/mpaciello\">Mike Paciello</a>, to name a few.</p>\n<p>They’ve done <em>incredible</em> work in this space, and are continuing to do so. It’d be wise to listen to what they have to say.</p>\n<hr>\n<p>This is a personal post on a personal website, so it’s admittedly a little more rough and glum than what I usually put out. However, I don’t have the right to be tired or demotivated. I’m frustrated for sure, and feelings of defeatism are hard to quell, but the stakes are too high for self-pity.</p>\n<p>I’m also not so arrogant as to assume my ideas are new in this space. I don’t have comments on my blog, but if you want to talk about anything this post covered, feel free to <a href=\"https://twitter.com/ericwbailey/status/1103043260631658497\">chime in on Twitter</a>.</p>\n<p>I’ll keep writing, and I’ll keep pushing for what is important. I hope you’ll join me.</p>\n",
      "date_published": "2019-05-02T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Revisiting prefers-reduced-motion, the reduced motion media query",
      "content_html": "",
      "date_published": "2019-04-29T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "An Introduction to the Reduced Motion Media Query",
      "content_html": "",
      "date_published": "2019-04-23T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "slashbot",
      "content_html": "",
      "date_published": "2019-03-14T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Paint the Picture, Not the Frame: How Browsers Provide Everything Users Need",
      "content_html": "",
      "date_published": "2019-02-06T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Little Library",
      "content_html": "",
      "date_published": "2019-01-13T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Reader Mode: The Button to Beat",
      "content_html": "",
      "date_published": "2019-01-06T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Web components still need to be accessible",
      "content_html": "",
      "date_published": "2018-12-19T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Be the Villain",
      "content_html": "",
      "date_published": "2018-12-05T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Quick test: Large touch targets",
      "content_html": "",
      "date_published": "2018-11-20T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "A designer developing for Android",
      "content_html": "",
      "date_published": "2018-11-07T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Quick Tip: Use the “lang” Attribute for Better Accessibility",
      "content_html": "",
      "date_published": "2018-10-22T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "The Importance of Heading Levels for Assistive Technology",
      "content_html": "",
      "date_published": "2018-10-21T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "The Importance Of Manual Accessibility Testing",
      "content_html": "",
      "date_published": "2018-09-11T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "The possibilities of the color-adjust property",
      "content_html": "",
      "date_published": "2018-08-13T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Don&#39;t Use The Placeholder Attribute",
      "content_html": "",
      "date_published": "2018-06-19T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "How to Lead Better User Interviews",
      "content_html": "",
      "date_published": "2018-06-11T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Focusing on Focus Styles",
      "content_html": "",
      "date_published": "2018-03-28T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Building a Good Download… Button?",
      "content_html": "",
      "date_published": "2018-02-02T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "How to build a cloud-hosted accessibility testing Windows computer using Amazon WorkSpaces",
      "content_html": "",
      "date_published": "2017-12-16T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "How accessible is your website for the disabled? Consider doing an audit to find out",
      "content_html": "",
      "date_published": "2017-11-16T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Consistently Inconsistent: When the Most Accessible Experience is Different for Each User",
      "content_html": "",
      "date_published": "2017-11-13T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Keeping track of letter-spacing, some guidelines",
      "content_html": "",
      "date_published": "2017-10-03T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/writing/equifax-data-breach-credit-freezes-and-beholden-design/",
      "url": "https://ericwbailey.design/writing/equifax-data-breach-credit-freezes-and-beholden-design/",
      "title": "Equifax Data Breach, Credit Freezes, and Beholden Design",
      "content_html": "<p>Ever been frustrated because a movie theater plays advertisements before the trailers even start? This is a kind of experience I call “Beholden Design.”</p>\n<p>Full of <a href=\"https://darkpatterns.org/\">Dark Patterns</a> and pain, Beholden Design is the evil, goatee-wearing twin of <a href=\"https://en.m.wikipedia.org/wiki/Universal_design\">Universal Design</a>. It forces people to interact with interfaces in order to get what they need—the other option typically being a dire consequence. This is the opposite of most experiences, where the person has a choice in whether or not to use a service.</p>\n<p>If you look at the world through this lens you’ll begin to see a lot of it, in varying degrees of severity: tax forms (both physical and digital), healthcare-related websites and systems, DMVs, ATMs, etc.</p>\n<p>Practitioners of Beholden Design visit suboptimal experiences on their users, either unconsciously via ignorance or negligence, or deliberately as an attempt to push a person into a choice where they create profit. In my opinion, both are inexcusable.</p>\n<p>In this post, I’m going to talk about a Beholden Design experience that’s very much of the moment: <a href=\"https://web.archive.org/web/20170914030151/https://www.washingtonpost.com/business/technology/what-you-need-to-know-about-the-equifax-data-breach/2017/09/09/46d20dc4-957d-11e7-8482-8dc9a7af29f9_story.html\">the Equifax data breach</a>.</p>\n<h2 id=\"equifax\">Equifax</h2>\n<p>Equifax is one of the three main United States credit reporting companies. Credit reporting companies track US citizens using direct and indirect data gathering techniques to rate their credit scores. These scores are then used to measure how potentially responsible a person will be for repaying loans—loans being the only real way to make the larger purchases that let most people <a href=\"http://marketrealist.com/2015/09/understanding-role-credit-economy/\">function in society</a>.</p>\n<p>Pretty messed up, right?</p>\n<p>Ignoring for the moment that these data gathering techniques are less than perfect (and definitely prone to <a href=\"https://en.m.wikipedia.org/wiki/Algorithmic_bias\">algorithmic bias</a>), the entire US population is essentially auto-opted into participating in these privately-run services. This is an especially terrifying fact in the wake of the Equifax data breach of September 2017, where the personal data of 143 million unwitting people was compromised.</p>\n<p>For a tech-savvy individual, access to about two thirds of the US population’s <a href=\"https://en.m.wikipedia.org/wiki/Personally_identifiable_information\">personally identifying information</a> means mass credit fraud is essentially now a turnkey process.</p>\n<p>All the information required to pretend to be someone else and take out a loan in their name has been removed from the purportedly secure Equifax servers. There is no historical precedent for the scale of this kind of event, or its ramifications.</p>\n<p>One of the options an individual can take—either as a victim or proactively—is to request what is known as a Credit Freeze. <a href=\"https://www.washingtonpost.com/news/the-switch/wp/2017/09/09/after-the-equifax-breach-heres-how-to-freeze-your-credit-to-protect-your-identity/\">A Credit Freeze places restrictions</a> on who can view your credit report, effectively preventing new lines of credit from being issued. A code is then issued by the company the freeze is requested at, which can be used at a later date to reinstate credit report access.</p>\n<p>Vexingly, the information required to request a lift on a Credit Freeze is also the information that was stolen in the breach.</p>\n<p>While this entire system is a perfect opportunity for the application of some big-picture <a href=\"https://en.m.wikipedia.org/wiki/Service_design\">Service Design thinking</a>, I’m going to focus on the experience of a person requesting a Credit Freeze.</p>\n<h2 id=\"inwardly-focused\">Inwardly focused</h2>\n<p>Beholden Design is selfish. It’s systems are built to serve the service’s need, not the needs of the person who needs the service.</p>\n<p>In requesting a Credit Freeze, an individual has to petition each service that monitors them. In addition to the big three companies (<a href=\"https://www.freeze.equifax.com/Freeze/jsp/SFF_PersonalIDInfo.jsp\">Equifax</a>, <a href=\"https://www.transunion.com/credit-freeze/place-credit-freeze\">TransUnion</a>, and <a href=\"https://www.experian.com/freeze/center.html\">Experian</a>), there are a few smaller ones (<a href=\"https://www.innovis.com/personal/securityFreeze\">Innovis</a> and <a href=\"https://www.chexsystems.com/web/chexsystems/consumerdebit/page/securityfreeze/placefreeze\">ChexSystems</a>). There might be others out there—I’m honestly not sure and frankly that’s part of the problem.</p>\n<p>While these companies have access to your contact information, the current state of affairs dictates that a person must reach out and request a Credit Freeze to each company individually using its own freeze request service.</p>\n<p>Placing the onus on all credit reporting companies to honor a single request issued by the user would ultimately make for a better experience for all involved. A single, centralized command could reduce potential errors across the board.</p>\n<h2 id=\"the-forms-themselves\">The forms themselves</h2>\n<p>The forms these companies serve up are the holy grail of bad design. Every aspect of them are user-hostile, yet are necessary for protecting oneself from harm.</p>\n<p><img\n  alt=\"Screenshots of the first page for initiating a Credit Freeze for Equifax, TransUnion, Experian, Innovis, and ChexSystems.\"\n  src=\"/img/posts/equifax-data-breach-credit-freezes-and-beholden-design/sites-thumb.png\" /></p>\n<h2 id=\"inconsistent\">Inconsistent</h2>\n<p>In Beholden Design, the priority is that input data satisfies the needs of internal systems, and not the end user. To that point, each Credit Freeze request form requests the same information in a slightly different manner, with different language and number of overall steps in the process.</p>\n<p>From the perspective of person who has undertaken the effort to go through each service to request a freeze, the process appears to lack standardization. This can lead to feelings of anger, frustration, uncertainty, and suspicion in a situation where the stakes are high.</p>\n<p>There is a very good chance this might be the first page a person encounters when visiting one of these kinds of sites. Interactions that might be standard relative to the credit monitoring website might not reflect the way the majority of forms on the rest of the internet operate.</p>\n<p>The person visiting might not have any prior experience with this atypical navigation. The kinds of information being asked for in this process aren’t exotic. Lean on <a href=\"https://developer.paciellogroup.com/blog/2017/08/inclusive-design-principle-be-consistent/\">external consistency</a> to help move a person through the process with as little friction as possible.</p>\n<h2 id=\"verbose-and-vague\">Verbose and vague</h2>\n<p>Another hallmark of Beholden Design is an overwhelming application of legal copy and jargon.</p>\n<p>These forms all have too much content and not in the right place. For inward-facing priorities, satisfying the legal team is paramount, even if the resulting copy is incomprehensible to the layperson it affects.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"I'm not sure why ZIP Code is trademarked, Experian.\">\n  <img\n    alt=\"ZIP Code™*\"\n    src=\"/img/posts/equifax-data-breach-credit-freezes-and-beholden-design/experian-trademark-zip-code.png\" />\n  <figcaption>\n    <p>I'm not sure why ZIP Code is trademarked, Experian.</p>\n  </figcaption>\n</figure>\n<p>A well-designed form can satisfy legal requirements, but also be usable. The two tricks to this are to offer the right thing at the right time, and to anticipate questions and provide just-in-time explanations.</p>\n<p>If a form asks for an atypical or sensitive piece of information, head suspicion off at the pass and explain what it will be used for as close to the relevant input field as possible. If there is a huge preamble to undertaking the form, use <a href=\"https://web.archive.org/web/20170914030151/https://en.m.wikipedia.org/wiki/Progressive_disclosure\">progressive disclosure</a> to break it apart and place the relevant content with the input fields it affects.</p>\n<h2 id=\"invalid\">Invalid</h2>\n<p>Validation is the process of verifying that information entered into a form is both correct and formatted properly. It is a broad and deep practice within the fields of design and security, and it can go a long way to preventing events like this data breach from ever occurring.</p>\n<p><a href=\"https://uxplanet.org/designing-more-efficient-forms-assistance-and-validation-f26a5241199d\">Good form validation</a> walks the line between being easy to use and keeping malformed/malicious input from being entered. In Beholden Design, form validation is combative and unintuitive. It is concerned with getting the text entered into its systems with as little behind-the-scenes manipulation as possible.</p>\n<p>An example of this is requiring phone numbers to not use parenthesis for the area code, even if a person is used to writing out that information in other contexts.</p>\n<p>While it is trivial to programmatically manipulate this information to be standardized after the user submits the form, Beholden Design is satisfied with the cheaper option: letting the user do all the work.</p>\n<p>Beholden Design is also lazy. It will typically only expose these kinds of formatting needs only after the form is submitted, and usually in an angry blob of messaging at the top of the form. This practice violates the <a href=\"http://graphicdesign.spokanefalls.edu/tutorials/process/gestaltprinciples/gestaltprinc.htm\">Gestalt Principles</a> of <em>proximity</em> and <em>continuation</em>.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"Errors are not placed next to the form fields they apply to. Form fields with errors are not highlighted. Proper formats for required information are not specified. Color does not correspond to the required input indicator (*). Validation only occurs when the entire form is submitted.\">\n  <img\n    alt=\"Screenshot of an angry blob of validation error messages at the top of the page.\"\n    src=\"/img/posts/equifax-data-breach-credit-freezes-and-beholden-design/experian-validation-errors.png\" />\n  <figcaption>\n    <p>Errors are not placed next to the form fields they apply to. Form fields with errors are not highlighted. Proper formats for required information are not specified. Color does not correspond to the required input indicator (*). Validation only occurs when the entire form is submitted.</p>\n  </figcaption>\n</figure>\n<p>Curiously, this approach to validation tends to have the unintended consequence of encouraging bad input.</p>\n<p>A frustrated user will attempt to fix form errors with expedience instead of accuracy—even if the information they are entering is of utmost importance. Ever slapped the side of a computer when it’s not responding to try and get it to work? It’s exactly like that.</p>\n<p>Another interesting aspect of Beholden Design form validation is that it tends to make gross assumptions about the kind of content it will be reviewing. When you don’t <a href=\"http://spaceninja.com/2015/12/07/falsehoods-programmers-believe/\">accommodate for the nuance involved in the kinds of information you’re asking for</a>, the potential to lock people out increases exponentially—especially if operating at a national scale.</p>\n<p>Instead, accompany input with just-in-time messaging that informs the user after they move to another form field. Or better yet, place hints and examples in close proximity to the form field. A judicious application of user testing can reveal which kinds of information people will struggle with.</p>\n<p>It goes without saying that you should go the extra mile and be able to process all the falsehood cases outlined in the link two paragraphs before this one.</p>\n<h2 id=\"insecure-and-ugly\">Insecure and ugly</h2>\n<p>The <a href=\"https://twitter.com/webster/status/906346071210778625\">horrid details</a> of Equifax’s negligent security practices are being <a href=\"https://arstechnica.com/information-technology/2017/09/why-the-equifax-breach-is-very-possibly-the-worst-leak-of-personal-info-ever/\">gleefully dissected elsewhere by industry professionals</a>, so they won’t be discussed here.</p>\n<p>However, it is important to remember that the presentation of the Credit Freeze request form in its entirety is also a consideration. Simply put, if the page does not feel legitimate, it will be treated as such. Sorry Equifax, that patronizing stock photo of a confident woman won’t count for much.</p>\n<p>Beholden Design loves to ignore these kinds of less glamorous, yet critical pages in favor of splashy homepages that giddily announce new features. Eventually, the gap between these internally prioritized pages and the neglected ones becomes too wide, and the experience becomes incongruous.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"The slickly designed responsive Experian homepage compared to the clunky, fixed-width Credit Freeze request page.\">\n  <img\n    alt=\"A side by side comparison of screenshots of Experian's homepage and Credit Freeze request form.\"\n    src=\"/img/posts/equifax-data-breach-credit-freezes-and-beholden-design/experian-homepage-vs-credit-freeze-form.png\" />\n  <figcaption>\n    <p>The slickly designed responsive Experian homepage compared to the clunky, fixed-width Credit Freeze request page.</p>\n  </figcaption>\n</figure>\n<p>Another large contributor to this split is the proliferation of third party features bolted onto the site with little consideration of how it will affect the existing experience. Larger companies are especially guilty of this—absorbing competitors and jamming their content into the site without vetting content, interaction, or quality of code and security.</p>\n<p>Of all the issues presented in this post, this one might be the easiest to plead a case for remediating in the wake of the Equifax hack. While assurances of <a href=\"https://www.nngroup.com/articles/credibility-china/\">security and credibility are somewhat a cultural issue</a>, it is comparatively trivial to make cosmetic updates to bring these orphaned, lower priority pages back in step with the rest of the site.</p>\n<p><a href=\"https://www.smashingmagazine.com/2016/05/creating-a-living-style-guide-case-study/\">Living styleguides</a>—catalogs of common interface and branding elements that are built from the live site's code—are a great way to ensure these kinds of visual tweaks can affect every page in the site quickly and with minimal fuss.</p>\n<p>Components such as form inputs that have been derived from a centralized source have the benefit being able to be quickly and globally updated from upstream changes, so long as they maintain code parity.</p>\n<p>This consistency is great for both QA and security efforts. Vetting the initial component means a good deal of edge case issues get killed off before they can ever become a problem, allowing them to be used with confidence. This frees QA testers and security auditors to efficiently focus their efforts on larger, more important tasks.</p>\n<h2 id=\"opaque\">Opaque</h2>\n<p>Beholden Designed systems are indifferent. With them, the truth is irrelevant and people that use these systems are irksome afterthoughts.</p>\n<p>The Credit Freeze process typically asks the user requesting it to verify themselves by having them select some personally identifying information contained in a few multiple choice questions. Ignoring the fact that this information is typically easy to gather from publicly available sources, these systems don’t communicate how they came to know this information, or how it’s being used. Creepy.</p>\n<p>Furthermore, as these information gathering systems are fallible, the situation can arise where there is a difference between the system’s truth and the actual truth.</p>\n<p>There is no obvious method to set the record straight in this situation. Instead, a user must typically make a guess as to what the system believes to be true, otherwise they cannot progress through the remainder of the Credit Freeze request process.</p>\n<p>Not a great way to maintain trust, if you ask me.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"I don't know if I'm a victim of identity theft. Or if you think I'm a victim of identity theft. That's why I'm here, Innovis.\">\n  <img\n    alt=\"Are you a victim of identity theft? A. No, I am not a victim of identity theft or B. Yes, I am a victim of identity theft.\"\n    src=\"/img/posts/equifax-data-breach-credit-freezes-and-beholden-design/innovis-id-theft.png\" />\n  <figcaption>\n    <p>I don't know if I'm a victim of identity theft. Or if you think I'm a victim of identity theft. That's why I'm here, Innovis.</p>\n  </figcaption>\n</figure>\n<p>If a person successfully goes through the process of requesting a Credit Freeze and is issued a code, typically all communication stops. While the emotional context of the person must be considered throughout this entire process, this is one of the most important moments to focus on.</p>\n<p>For the services that mail a Credit Freeze unlock code instead of a delivering it digitally, it is radio silence until something shows up in the mail. You don’t have to be paranoid to understand how the person requesting the code being able to successfully receive it is in everyone’s best interests.</p>\n<p>Turning a blind eye to the massive inefficiencies and potential for errors in this processes, it is baffling that the systems that require contact information they already possess don’t use it to communicate where they are in the process of addressing the request.</p>\n<p>I guarantee you that while people may be fretting about the status of their requests, they certainly aren’t waiting at home for the code to show up.</p>\n<p>A little communication would go a long way in this situation. A good model to build from is a package delivery service such as FedEx emailing a person about what is happening to their holiday gift order at every stage in the process until delivery.</p>\n<h2 id=\"unresponsive\">Unresponsive</h2>\n<p>Beholden Design lives in the past.</p>\n<p>In addition to the lack of responsiveness from the process outlined in the previous section, the majority of these forms do not respond to the size of the screen of the device the person is using to access it. Of the five services I audited, only one of them adapted to a narrow screen size. Congratulations Innovis, you’re safe this round.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"TransUnion does not get points for being Responsive. Time for some squinting and pinching.\">\n  <img\n    alt=\"Screenshot of TransUnion's unresponsive website in iOS Mobile Safari.\"\n    src=\"/img/posts/equifax-data-breach-credit-freezes-and-beholden-design/transunion-unresponsive.png\" />\n  <figcaption>\n    <p>TransUnion does not get points for being Responsive. Time for some squinting and pinching.</p>\n  </figcaption>\n</figure>\n<p><a href=\"https://en.m.wikipedia.org/wiki/Responsive_web_design\">Responsive Web Design</a> is no longer a groundbreaking technique. It is now very much a part of the everyday web browsing experience. In the age of cheap, mass-produced web-capable devices such as phones, tablets, and e-readers, it is ridiculous to assume that a person will use a desktop computer to access information.</p>\n<p>For many people who are economically disadvantaged, one of these devices may be <a href=\"https://www.technologyreview.com/s/603083/the-unacceptable-persistence-of-the-digital-divide/\">their only point of entry for the web</a>. It doesn’t take much imagination to understand the emotions of a person in this sort of situation.</p>\n<p>While appeals to empathy and usability typically fall on deaf ears in most Beholden Design situations, there are legitimate business cases to be made for making your site responsive.</p>\n<p>Much as how we don’t put our movies on VHS cassettes anymore, an unresponsive site is an anachronistic aberration. Google penalizes static-width sites in its search ranking algorithm, and users tend to shy away from them once encountered. If you’re in the business of data gathering, this should give you pause for concern.</p>\n<p>In addition, a responsively designed site is easier to maintain in the long run. Working and serving the site from a single, unified codebase frees up critical development resources to be used elsewhere, say shoring up security.</p>\n<h2 id=\"outsourced\">Outsourced</h2>\n<p>Beholden Design loves to hire other people to do the work for them.</p>\n<p>There’s a second wave of web design that hasn’t yet permeated organizations that practice Beholden Design. It is no longer sufficient to have a presence on the internet, nor is it safe to be the sole provider of a service. Competition is fierce, fast, and totally unsympathetic to the plights of their competitors.</p>\n<p>Oftentimes, the forms discussed in this post are the end result of long-negotiated contracts with vendors who provide one-size-fits-all solutions to business needs. Whatever an afterthought is, these kinds of experiences typically sit far below it.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"Which way am I supposed to scan this form?\">\n  <img\n    alt=\"Screenshot illustrating ambiguity in the visual scan pattern of Equifax's form. It is unclear if you are supposed to read the form vertically or horizontally.\"\n    src=\"/img/posts/equifax-data-breach-credit-freezes-and-beholden-design/equifax-scan-patterns.png\" />\n  <figcaption>\n    <p>Which way am I supposed to scan this form?</p>\n  </figcaption>\n</figure>\n<p>Receiving quality deliverables from these kinds of vendors requires diligence on the part of the purchasing organization. Ask questions about every aspect of the contract, put the screws to vague sales claims, demand excellence in every part of the process. The lowest bidder must accommodate a request if the entire industry is demanding it.</p>\n<h2 id=\"inaccessible\">Inaccessible</h2>\n<p>Beholden Design is unempathetic.</p>\n<p>Each of the five sites reported accessibility errors when audited. These errors ranged in severity from a few difficult roadblocks to entirely broken systems that don’t allow people browsing with assistive technology to successfully request a Credit Freeze.</p>\n<figure\n  role=\"figure\"\n  aria-label=\"Deque's aXe accessibility audit tool reporting 60 violations on a single page of the ChexSystems Credit Freeze request process.\">\n  <img\n    alt=\"Screenshot of aXe's detailed accessibility report. There are 60 violations found, with errors detected for ARIA roles, color contrast, unique ID attributes, the lang attribute, alternate text, missing form labels, disabled zooming, and ungrouped radio inputs.\"\n    src=\"/img/posts/equifax-data-breach-credit-freezes-and-beholden-design/chexsystems-accessibility-errors.png\" />\n  <figcaption>\n    <p>Deque's aXe accessibility audit tool reporting 60 violations on a single page of the ChexSystems Credit Freeze request process.</p>\n  </figcaption>\n</figure>\n<p>To say it plainly: Because of the way it is designed and coded, the current Credit Freeze request process excludes thousands of people from being able to use it.</p>\n<p>Following <a href=\"https://www.forbes.com/sites/legalnewsline/2017/06/13/first-of-its-kind-trial-goes-plaintiffs-way-winn-dixie-must-update-website-for-the-blind/#70ce1ca61b38\">the landmark Winn-Dixie case</a>, there is now legal precedent for private individuals to successfully sue private companies for being unable to operate a website. Unlike <a href=\"https://en.m.wikipedia.org/wiki/National_Federation_of_the_Blind_v._Target_Corp.\">National Federation of the Blind v. Target Corp.</a>, it no longer requires a class action lawsuit with the weight of an entire organization behind it to go to court.</p>\n<p>For something as public and far-reaching as this data breach case, shutting people out because of the method they use to access the web is a huge liability. The less-than-stellar legal practice of <a href=\"https://motherboard.vice.com/en_us/article/wjjv99/class-action-lawyers-say-equifax-cant-prevent-you-from-suing-them\">binding arbitration</a> may not prevent people from taking legal action, either.</p>\n<p>Beholden Design also loves to ignore the truth.</p>\n<p>Accessibility compliance is more than just accommodating blind individuals. It is also more than thinking a separate-but-equal companion site is acceptable. It is a fallacy that every individual <a href=\"http://adrianroselli.com/2017/02/not-all-screen-reader-users-are-blind.html\">navigating the web with a screen reader</a> is blind. Not every person who is able-bodied will be forever—remember, <a href=\"http://uxmag.com/articles/we-re-just-temporarily-abled\">we’re all just temporarily abled</a>.</p>\n<p>Some may argue that the alternatives—a phone support help line and a physically mailed request form—obviate the need to make these webpages compliant. However, these options are limited in their capacity to accommodate. It’s also worth noting that in the wake of the breach, both the call and mail processing centers for these institutions are going to be overloaded (to say nothing of trust issues with another poorly-paid human handling this info). Errors and neglect will inevitably follow.</p>\n<p>It is cheaper, easier, more secure, and more convenient to let a person access the information they need in a manner that works for them. These alternative options may fall short of every possible combination of conditions someone can experience. One of the strengths of accessible digital technology is that it is interoperable, meaning that it can be modified to satisfy the needs of the person using it.</p>\n<h2 id=\"so%2C-what%E2%80%99s-to-be-done%3F\">So, what’s to be done?</h2>\n<p>If you are a practitioner of Beholden Design, either unconsciously or deliberately, these are some ugly truths to face.</p>\n<p>I think the belief that some institutions are <a href=\"https://en.m.wikipedia.org/wiki/Too_big_to_fail\">too big to fail</a> is about to be put to the test. There have already been calls for the <a href=\"https://www.nytimes.com/2017/09/08/technology/seriously-equifax-why-the-credit-agencys-breach-means-regulation-is-needed.html\">corporate death penalty</a>—to say nothing of the fact that our current economy loves to bet on small, disruptive companies upsetting the status quo.</p>\n<p>Ultimately, this is a solid business case for empathy. I’m not talking about the feelgood checklist kind that stipulates stock photography uses a cringe-inducingly obvious cast of multicultural characters. I’m talking about the kind that bakes these kinds of considerations into the beginning of every part of the business and its processes.</p>\n<p>This kind of change in thinking is a massive undertaking for organizations who don’t already practice it. It represents a transformation from a passive, reactive method of conducting business to an active and dynamic one that places the user first in all aspects of the experience.</p>\n<p>To be completely honest, institutional memory and habit are difficult forces to fight (to say nothing of <a href=\"https://www.meridianks.com/workplace-epidemic-knowledge-hoarding/\">knowledge hoarding</a> and fiefdoms). New marching orders will probably cost people their jobs. However, in the face of annihilation, either by competition or legal action, it is a small price for an organization to pay.</p>\n<p>Recognize some dark part of yourself in this post? You don’t have to go it alone.</p>\n<p>Cantina offers expertise in the kinds of disciplines needed, including organizational and service design, technical architecture, internet of things, responsive front end development and design, and product development. If you’d like to make the transition away from being a Beholden Design-led organization, <a href=\"https://ericwbailey.design/#section-contact\">make contact</a> today.</p>\n",
      "date_published": "2017-09-10T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Make technology work for you, not the other way around",
      "content_html": "",
      "date_published": "2017-07-19T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Let’s Talk About Speech CSS",
      "content_html": "",
      "date_published": "2017-07-10T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Crafting a chatbot people will use: Part 2",
      "content_html": "",
      "date_published": "2017-07-05T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Crafting a chatbot people will use: Part 1",
      "content_html": "",
      "date_published": "2017-06-20T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Accessible SVGs in High Contrast Mode",
      "content_html": "",
      "date_published": "2017-06-20T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Improving the User Experience of IoT Firmware Updates",
      "content_html": "",
      "date_published": "2016-11-14T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Building a better button in CSS",
      "content_html": "",
      "date_published": "2016-10-18T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Instituting a culture of accessibility in your organization: Part 2",
      "content_html": "",
      "date_published": "2016-07-26T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Organizational buy-in on Responsive Design",
      "content_html": "",
      "date_published": "2016-06-01T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Instituting a culture of accessibility in your organization: Part 1",
      "content_html": "",
      "date_published": "2016-04-04T20:00:00-04:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "Battery Status API: We need to talk",
      "content_html": "",
      "date_published": "2016-01-12T19:00:00-05:00"
    },{
      "id": "https://ericwbailey.design/",
      "url": "https://ericwbailey.design/",
      "title": "I’ll Make an Exception Just for You: Using the Exception Comment to Help Maintain Mature, Large-scale Sass Projects",
      "content_html": "",
      "date_published": "2015-10-29T20:00:00-04:00"
    }
  ]
}
